================================================================================
Example 1 - https://github.github.com/gfm/#example-1
================================================================================
	foo	baz		bim

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)))

================================================================================
Example 2 - https://github.github.com/gfm/#example-2
================================================================================
  	foo	baz		bim

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)))

================================================================================
Example 3 - https://github.github.com/gfm/#example-3
================================================================================
    a	a
    ὐ	a

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)
    (line_break)
    (text)))

================================================================================
Example 4 - https://github.github.com/gfm/#example-4
================================================================================
  - foo

	bar

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (paragraph
        (text)))))

================================================================================
Example 5 - https://github.github.com/gfm/#example-5
================================================================================
- foo

		bar

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (indented_code_block
        (virtual_space)
        (virtual_space)
        (text)))))

================================================================================
Example 6 - https://github.github.com/gfm/#example-6
================================================================================
>		foo

--------------------------------------------------------------------------------

(document
  (block_quote
    (indented_code_block
      (virtual_space)
      (virtual_space)
      (text))))

================================================================================
Example 7 - https://github.github.com/gfm/#example-7
================================================================================
-		foo

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (indented_code_block
        (virtual_space)
        (virtual_space)
        (text)))))

================================================================================
Example 8 - https://github.github.com/gfm/#example-8
================================================================================
    foo
	bar

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)
    (line_break)
    (text)))

================================================================================
Example 9 - https://github.github.com/gfm/#example-9
================================================================================
 - foo
   - bar
	 - baz

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (tight_list
        (list_item
          (list_marker)
          (paragraph
            (text))
          (tight_list
            (list_item
              (list_marker)
              (paragraph
                (text)))))))))

================================================================================
Example 10 - https://github.github.com/gfm/#example-10
================================================================================
#	Foo

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text))))

================================================================================
Example 11 - https://github.github.com/gfm/#example-11
================================================================================
*	*	*	

--------------------------------------------------------------------------------

(document
  (thematic_break))

================================================================================
Example 12 - https://github.github.com/gfm/#example-12
================================================================================
- `one
- two`

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 13 - https://github.github.com/gfm/#example-13
================================================================================
***
---
___

--------------------------------------------------------------------------------

(document
  (thematic_break)
  (thematic_break)
  (thematic_break))

================================================================================
Example 14 - https://github.github.com/gfm/#example-14
================================================================================
+++

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 15 - https://github.github.com/gfm/#example-15
================================================================================
===

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 16 - https://github.github.com/gfm/#example-16
================================================================================
--
**
__

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 17 - https://github.github.com/gfm/#example-17
================================================================================
 ***
  ***
   ***

--------------------------------------------------------------------------------

(document
  (thematic_break)
  (thematic_break)
  (thematic_break))

================================================================================
Example 18 - https://github.github.com/gfm/#example-18
================================================================================
    ***

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)))

================================================================================
Example 19 - https://github.github.com/gfm/#example-19
================================================================================
Foo
    ***

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 20 - https://github.github.com/gfm/#example-20
================================================================================
_____________________________________

--------------------------------------------------------------------------------

(document
  (thematic_break))

================================================================================
Example 21 - https://github.github.com/gfm/#example-21
================================================================================
 - - -

--------------------------------------------------------------------------------

(document
  (thematic_break))

================================================================================
Example 22 - https://github.github.com/gfm/#example-22
================================================================================
 **  * ** * ** * **

--------------------------------------------------------------------------------

(document
  (thematic_break))

================================================================================
Example 23 - https://github.github.com/gfm/#example-23
================================================================================
-     -      -      -

--------------------------------------------------------------------------------

(document
  (thematic_break))

================================================================================
Example 24 - https://github.github.com/gfm/#example-24
================================================================================
- - - -    

--------------------------------------------------------------------------------

(document
  (thematic_break))

================================================================================
Example 25 - https://github.github.com/gfm/#example-25
================================================================================
_ _ _ _ a

a------

---a---

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (paragraph
    (text))
  (paragraph
    (text)))

================================================================================
Example 26 - https://github.github.com/gfm/#example-26
================================================================================
 *-*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text))))

================================================================================
Example 27 - https://github.github.com/gfm/#example-27
================================================================================
- foo
***
- bar

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))))
  (thematic_break)
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 28 - https://github.github.com/gfm/#example-28
================================================================================
Foo
***
bar

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (thematic_break)
  (paragraph
    (text)))

================================================================================
Example 29 - https://github.github.com/gfm/#example-29
================================================================================
Foo
---
bar

--------------------------------------------------------------------------------

(document
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline))
  (paragraph
    (text)))

================================================================================
Example 30 - https://github.github.com/gfm/#example-30
================================================================================
* Foo
* * *
* Bar

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))))
  (thematic_break)
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 31 - https://github.github.com/gfm/#example-31
================================================================================
- Foo
- * * *

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (thematic_break))))

================================================================================
Example 32 - https://github.github.com/gfm/#example-32
================================================================================
# foo
## foo
### foo
#### foo
##### foo
###### foo

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text))))

================================================================================
Example 33 - https://github.github.com/gfm/#example-33
================================================================================
####### foo

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 34 - https://github.github.com/gfm/#example-34
================================================================================
#5 bolt

#hashtag

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (paragraph
    (text)))

================================================================================
Example 35 - https://github.github.com/gfm/#example-35
================================================================================
\## foo

--------------------------------------------------------------------------------

(document
  (paragraph
    (backslash_escape)
    (text)))

================================================================================
Example 36 - https://github.github.com/gfm/#example-36
================================================================================
# foo *bar* \*baz\*

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)
      (emphasis
        (text))
      (text)
      (backslash_escape)
      (text)
      (backslash_escape))))

================================================================================
Example 37 - https://github.github.com/gfm/#example-37
================================================================================
#                  foo                     

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text))))

================================================================================
Example 38 - https://github.github.com/gfm/#example-38
================================================================================
 ### foo
  ## foo
   # foo

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text))))

================================================================================
Example 39 - https://github.github.com/gfm/#example-39
================================================================================
    # foo

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)))

================================================================================
Example 40 - https://github.github.com/gfm/#example-40
================================================================================
foo
    # bar

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 41 - https://github.github.com/gfm/#example-41
================================================================================
## foo ##
  ###   bar    ###

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text))))

================================================================================
Example 42 - https://github.github.com/gfm/#example-42
================================================================================
# foo ##################################
##### foo ##

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text))))

================================================================================
Example 43 - https://github.github.com/gfm/#example-43
================================================================================
### foo ###     

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text))))

================================================================================
Example 44 - https://github.github.com/gfm/#example-44
================================================================================
### foo ### b

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text))))

================================================================================
Example 45 - https://github.github.com/gfm/#example-45
================================================================================
# foo#

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text))))

================================================================================
Example 46 - https://github.github.com/gfm/#example-46
================================================================================
### foo \###
## foo #\##
# foo \#

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)
      (backslash_escape)
      (text)))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)
      (backslash_escape)
      (text)))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)
      (backslash_escape))))

================================================================================
Example 47 - https://github.github.com/gfm/#example-47
================================================================================
****
## foo
****

--------------------------------------------------------------------------------

(document
  (thematic_break)
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)))
  (thematic_break))

================================================================================
Example 48 - https://github.github.com/gfm/#example-48
================================================================================
Foo bar
# baz
Bar foo

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)))
  (paragraph
    (text)))

================================================================================
Example 49 - https://github.github.com/gfm/#example-49
================================================================================
## 
#
### ###

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker))
  (atx_heading
    (atx_heading_marker))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text))))

================================================================================
Example 50 - https://github.github.com/gfm/#example-50
================================================================================
Foo *bar*
=========

Foo *bar*
---------

--------------------------------------------------------------------------------

(document
  (setext_heading
    (heading_content
      (text)
      (emphasis
        (text)))
    (setext_heading_underline))
  (setext_heading
    (heading_content
      (text)
      (emphasis
        (text)))
    (setext_heading_underline)))

================================================================================
Example 51 - https://github.github.com/gfm/#example-51
================================================================================
Foo *bar
baz*
====

--------------------------------------------------------------------------------

(document
  (setext_heading
    (heading_content
      (text)
      (emphasis
        (text)
        (soft_line_break)
        (text)))
    (setext_heading_underline)))

================================================================================
Example 52 - https://github.github.com/gfm/#example-52
================================================================================
  Foo *bar
baz*	
====

--------------------------------------------------------------------------------

(document
  (setext_heading
    (heading_content
      (text)
      (emphasis
        (text)
        (soft_line_break)
        (text)))
    (setext_heading_underline)))

================================================================================
Example 53 - https://github.github.com/gfm/#example-53
================================================================================
Foo
-------------------------

Foo
=

--------------------------------------------------------------------------------

(document
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline))
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline)))

================================================================================
Example 54 - https://github.github.com/gfm/#example-54
================================================================================
   Foo
---

  Foo
-----

  Foo
  ===

--------------------------------------------------------------------------------

(document
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline))
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline))
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline)))

================================================================================
Example 55 - https://github.github.com/gfm/#example-55
================================================================================
    Foo
    ---

    Foo
---

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)
    (line_break)
    (text)
    (line_break)
    (line_break)
    (text))
  (thematic_break))

================================================================================
Example 56 - https://github.github.com/gfm/#example-56
================================================================================
Foo
   ----      

--------------------------------------------------------------------------------

(document
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline)))

================================================================================
Example 57 - https://github.github.com/gfm/#example-57
================================================================================
Foo
    ---

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 58 - https://github.github.com/gfm/#example-58
================================================================================
Foo
= =

Foo
--- -

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text))
  (paragraph
    (text))
  (thematic_break))

================================================================================
Example 59 - https://github.github.com/gfm/#example-59
================================================================================
Foo  
-----

--------------------------------------------------------------------------------

(document
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline)))

================================================================================
Example 60 - https://github.github.com/gfm/#example-60
================================================================================
Foo\
----

--------------------------------------------------------------------------------

(document
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline)))

================================================================================
Example 61 - https://github.github.com/gfm/#example-61
================================================================================
`Foo
----
`

<a title="a lot
---
of dashes"/>

--------------------------------------------------------------------------------

(document
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline))
  (paragraph
    (text))
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline))
  (paragraph
    (text)))

================================================================================
Example 62 - https://github.github.com/gfm/#example-62
================================================================================
> Foo
---

--------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph
      (text)))
  (thematic_break))

================================================================================
Example 63 - https://github.github.com/gfm/#example-63
================================================================================
> foo
bar
===

--------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph
      (text)
      (soft_line_break)
      (text)
      (soft_line_break)
      (text))))

================================================================================
Example 64 - https://github.github.com/gfm/#example-64
================================================================================
- Foo
---

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))))
  (thematic_break))

================================================================================
Example 65 - https://github.github.com/gfm/#example-65
================================================================================
Foo
Bar
---

--------------------------------------------------------------------------------

(document
  (setext_heading
    (heading_content
      (text)
      (soft_line_break)
      (text))
    (setext_heading_underline)))

================================================================================
Example 66 - https://github.github.com/gfm/#example-66
================================================================================
---
Foo
---
Bar
---
Baz

--------------------------------------------------------------------------------

(document
  (thematic_break)
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline))
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline))
  (paragraph
    (text)))

================================================================================
Example 67 - https://github.github.com/gfm/#example-67
================================================================================

====

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 68 - https://github.github.com/gfm/#example-68
================================================================================
---
---

--------------------------------------------------------------------------------

(document
  (thematic_break)
  (thematic_break))

================================================================================
Example 69 - https://github.github.com/gfm/#example-69
================================================================================
- foo
-----

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))))
  (thematic_break))

================================================================================
Example 70 - https://github.github.com/gfm/#example-70
================================================================================
    foo
---

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text))
  (thematic_break))

================================================================================
Example 71 - https://github.github.com/gfm/#example-71
================================================================================
> foo
-----

--------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph
      (text)))
  (thematic_break))

================================================================================
Example 72 - https://github.github.com/gfm/#example-72
================================================================================
\> foo
------

--------------------------------------------------------------------------------

(document
  (setext_heading
    (heading_content
      (backslash_escape)
      (text))
    (setext_heading_underline)))

================================================================================
Example 73 - https://github.github.com/gfm/#example-73
================================================================================
Foo

bar
---
baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline))
  (paragraph
    (text)))

================================================================================
Example 74 - https://github.github.com/gfm/#example-74
================================================================================
Foo
bar

---

baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text))
  (thematic_break)
  (paragraph
    (text)))

================================================================================
Example 75 - https://github.github.com/gfm/#example-75
================================================================================
Foo
bar
* * *
baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text))
  (thematic_break)
  (paragraph
    (text)))

================================================================================
Example 76 - https://github.github.com/gfm/#example-76
================================================================================
Foo
bar
\---
baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)
    (soft_line_break)
    (backslash_escape)
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 77 - https://github.github.com/gfm/#example-77
================================================================================
    a simple
      indented code block

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)
    (line_break)
    (text)))

================================================================================
Example 78 - https://github.github.com/gfm/#example-78
================================================================================
  - foo

    bar

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (paragraph
        (text)))))

================================================================================
Example 79 - https://github.github.com/gfm/#example-79
================================================================================
1.  foo

    - bar

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (tight_list
        (list_item
          (list_marker)
          (paragraph
            (text)))))))

================================================================================
Example 80 - https://github.github.com/gfm/#example-80
================================================================================
    <a/>
    *hi*

    - one

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)
    (line_break)
    (text)
    (line_break)
    (line_break)
    (text)))

================================================================================
Example 81 - https://github.github.com/gfm/#example-81
================================================================================
    chunk1

    chunk2
  
 
 
    chunk3

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)
    (line_break)
    (line_break)
    (text)
    (line_break)
    (line_break)
    (line_break)
    (line_break)
    (text)))

================================================================================
Example 82 - https://github.github.com/gfm/#example-82
================================================================================
    chunk1
      
      chunk2

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 83 - https://github.github.com/gfm/#example-83
================================================================================
Foo
    bar


--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 84 - https://github.github.com/gfm/#example-84
================================================================================
    foo
bar

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text))
  (paragraph
    (text)))

================================================================================
Example 85 - https://github.github.com/gfm/#example-85
================================================================================
# Heading
    foo
Heading
------
    foo
----

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)))
  (indented_code_block
    (text))
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline))
  (indented_code_block
    (text))
  (thematic_break))

================================================================================
Example 86 - https://github.github.com/gfm/#example-86
================================================================================
        foo
    bar

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)
    (line_break)
    (text)))

================================================================================
Example 87 - https://github.github.com/gfm/#example-87
================================================================================

    
    foo
    


--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)))

================================================================================
Example 88 - https://github.github.com/gfm/#example-88
================================================================================
    foo  

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)))

================================================================================
Example 89 - https://github.github.com/gfm/#example-89
================================================================================
```
<
 >
```

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text)
      (line_break)
      (text))))

================================================================================
Example 90 - https://github.github.com/gfm/#example-90
================================================================================
~~~
<
 >
~~~

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text)
      (line_break)
      (text))))

================================================================================
Example 91 - https://github.github.com/gfm/#example-91
================================================================================
``
foo
``

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 92 - https://github.github.com/gfm/#example-92
================================================================================
```
aaa
~~~
```

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text)
      (line_break)
      (text))))

================================================================================
Example 93 - https://github.github.com/gfm/#example-93
================================================================================
~~~
aaa
```
~~~

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text)
      (line_break)
      (text))))

================================================================================
Example 94 - https://github.github.com/gfm/#example-94
================================================================================
````
aaa
```
``````

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text)
      (line_break)
      (text))))

================================================================================
Example 95 - https://github.github.com/gfm/#example-95
================================================================================
~~~~
aaa
~~~
~~~~

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text)
      (line_break)
      (text))))

================================================================================
Example 96 - https://github.github.com/gfm/#example-96
================================================================================
```

--------------------------------------------------------------------------------

(document
  (fenced_code_block))

================================================================================
Example 97 - https://github.github.com/gfm/#example-97
================================================================================
`````

```
aaa

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (line_break)
      (text)
      (line_break)
      (text))))

================================================================================
Example 98 - https://github.github.com/gfm/#example-98
================================================================================
> ```
> aaa

bbb

--------------------------------------------------------------------------------

(document
  (block_quote
    (fenced_code_block
      (code_fence_content
        (text))))
  (paragraph
    (text)))

================================================================================
Example 99 - https://github.github.com/gfm/#example-99
================================================================================
```

  
```

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (line_break)
      (text))))

================================================================================
Example 100 - https://github.github.com/gfm/#example-100
================================================================================
```
```

--------------------------------------------------------------------------------

(document
  (fenced_code_block))

================================================================================
Example 101 - https://github.github.com/gfm/#example-101
================================================================================
 ```
 aaa
aaa
```

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text)
      (line_break)
      (text))))

================================================================================
Example 102 - https://github.github.com/gfm/#example-102
================================================================================
  ```
aaa
  aaa
aaa
  ```

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text)
      (line_break)
      (text)
      (line_break)
      (text))))

================================================================================
Example 103 - https://github.github.com/gfm/#example-103
================================================================================
   ```
   aaa
    aaa
  aaa
   ```

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text)
      (line_break)
      (text)
      (line_break)
      (text))))

================================================================================
Example 104 - https://github.github.com/gfm/#example-104
================================================================================
    ```
    aaa
    ```

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 105 - https://github.github.com/gfm/#example-105
================================================================================
```
aaa
  ```

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text))))

================================================================================
Example 106 - https://github.github.com/gfm/#example-106
================================================================================
   ```
aaa
  ```

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text))))

================================================================================
Example 107 - https://github.github.com/gfm/#example-107
================================================================================
```
aaa
    ```

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text)
      (line_break)
      (text))))

================================================================================
Example 108 - https://github.github.com/gfm/#example-108
================================================================================
``` ```
aaa

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))
    (soft_line_break)
    (text)))

================================================================================
Example 109 - https://github.github.com/gfm/#example-109
================================================================================
~~~~~~
aaa
~~~ ~~

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text)
      (line_break)
      (text))))

================================================================================
Example 110 - https://github.github.com/gfm/#example-110
================================================================================
foo
```
bar
```
baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (fenced_code_block
    (code_fence_content
      (text)))
  (paragraph
    (text)))

================================================================================
Example 111 - https://github.github.com/gfm/#example-111
================================================================================
foo
---
~~~
bar
~~~
# baz

--------------------------------------------------------------------------------

(document
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline))
  (fenced_code_block
    (code_fence_content
      (text)))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text))))

================================================================================
Example 112 - https://github.github.com/gfm/#example-112
================================================================================
```ruby
def foo(x)
  return 3
end
```

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (info_string
      (text))
    (code_fence_content
      (text)
      (line_break)
      (text)
      (line_break)
      (text))))

================================================================================
Example 113 - https://github.github.com/gfm/#example-113
================================================================================
~~~~    ruby startline=3 $%@#$
def foo(x)
  return 3
end
~~~~~~~

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (info_string
      (text))
    (code_fence_content
      (text)
      (line_break)
      (text)
      (line_break)
      (text))))

================================================================================
Example 114 - https://github.github.com/gfm/#example-114
================================================================================
````;
````

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (info_string
      (text))))

================================================================================
Example 115 - https://github.github.com/gfm/#example-115
================================================================================
``` aa ```
foo

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))
    (soft_line_break)
    (text)))

================================================================================
Example 116 - https://github.github.com/gfm/#example-116
================================================================================
~~~ aa ``` ~~~
foo
~~~

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (info_string
      (text))
    (code_fence_content
      (text))))

================================================================================
Example 117 - https://github.github.com/gfm/#example-117
================================================================================
```
``` aaa
```

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text))))

================================================================================
Example 118 - https://github.github.com/gfm/#example-118
================================================================================
<table><tr><td>
<pre>
**Hello**,

_world_.
</pre>
</td></tr></table>

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text))
  (paragraph
    (emphasis
      (text))
    (text)
    (soft_line_break)
    (html_close_tag
      (html_tag_name)))
  (html_block
    (text)))

================================================================================
Example 119 - https://github.github.com/gfm/#example-119
================================================================================
<table>
  <tr>
    <td>
           hi
    </td>
  </tr>
</table>

okay.

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)
    (line_break)
    (text)
    (line_break)
    (text)
    (line_break)
    (text)
    (line_break)
    (text))
  (paragraph
    (text)))

================================================================================
Example 120 - https://github.github.com/gfm/#example-120
================================================================================
 <div>
  *hello*
         <foo><a>

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 121 - https://github.github.com/gfm/#example-121
================================================================================
</div>
*foo*

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)))

================================================================================
Example 122 - https://github.github.com/gfm/#example-122
================================================================================
<DIV CLASS="foo">

*Markdown*

</DIV>

--------------------------------------------------------------------------------

(document
  (html_block
    (text))
  (paragraph
    (emphasis
      (text)))
  (html_block
    (text)))

================================================================================
Example 123 - https://github.github.com/gfm/#example-123
================================================================================
<div id="foo"
  class="bar">
</div>

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 124 - https://github.github.com/gfm/#example-124
================================================================================
<div id="foo" class="bar
  baz">
</div>

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 125 - https://github.github.com/gfm/#example-125
================================================================================
<div>
*foo*

*bar*

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text))
  (paragraph
    (emphasis
      (text))))

================================================================================
Example 126 - https://github.github.com/gfm/#example-126
================================================================================
<div id="foo"
*hi*

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)))

================================================================================
Example 127 - https://github.github.com/gfm/#example-127
================================================================================
<div class
foo

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)))

================================================================================
Example 128 - https://github.github.com/gfm/#example-128
================================================================================
<div *???-&&&-<---
*foo*

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)))

================================================================================
Example 129 - https://github.github.com/gfm/#example-129
================================================================================
<div><a href="bar">*foo*</a></div>

--------------------------------------------------------------------------------

(document
  (html_block
    (text)))

================================================================================
Example 130 - https://github.github.com/gfm/#example-130
================================================================================
<table><tr><td>
foo
</td></tr></table>

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 131 - https://github.github.com/gfm/#example-131
================================================================================
<div></div>
``` c
int x = 33;
```

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 132 - https://github.github.com/gfm/#example-132
================================================================================
<a href="foo">
*bar*
</a>

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 133 - https://github.github.com/gfm/#example-133
================================================================================
<Warning>
*bar*
</Warning>

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 134 - https://github.github.com/gfm/#example-134
================================================================================
<i class="foo">
*bar*
</i>

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 135 - https://github.github.com/gfm/#example-135
================================================================================
</ins>
*bar*

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)))

================================================================================
Example 136 - https://github.github.com/gfm/#example-136
================================================================================
<del>
*foo*
</del>

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 137 - https://github.github.com/gfm/#example-137
================================================================================
<del>

*foo*

</del>

--------------------------------------------------------------------------------

(document
  (html_block
    (text))
  (paragraph
    (emphasis
      (text)))
  (html_block
    (text)))

================================================================================
Example 138 - https://github.github.com/gfm/#example-138
================================================================================
<del>*foo*</del>

--------------------------------------------------------------------------------

(document
  (paragraph
    (html_open_tag
      (html_tag_name))
    (emphasis
      (text))
    (html_close_tag
      (html_tag_name))))

================================================================================
Example 139 - https://github.github.com/gfm/#example-139
================================================================================
<pre language="haskell"><code>
import Text.HTML.TagSoup

main :: IO ()
main = print $ parseTags tags
</code></pre>
okay

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (line_break)
    (text)
    (line_break)
    (text)
    (line_break)
    (text))
  (paragraph
    (text)))

================================================================================
Example 140 - https://github.github.com/gfm/#example-140
================================================================================
<script type="text/javascript">
// JavaScript example

document.getElementById("demo").innerHTML = "Hello JavaScript!";
</script>
okay

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (line_break)
    (text)
    (line_break)
    (text))
  (paragraph
    (text)))

================================================================================
Example 141 - https://github.github.com/gfm/#example-141
================================================================================
<style
  type="text/css">
h1 {color:red;}

p {color:blue;}
</style>
okay

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)
    (line_break)
    (line_break)
    (text)
    (line_break)
    (text))
  (paragraph
    (text)))

================================================================================
Example 142 - https://github.github.com/gfm/#example-142
================================================================================
<style
  type="text/css">

foo

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (line_break)
    (text)))

================================================================================
Example 143 - https://github.github.com/gfm/#example-143
================================================================================
> <div>
> foo

bar

--------------------------------------------------------------------------------

(document
  (block_quote
    (html_block
      (text)
      (line_break)
      (text)))
  (paragraph
    (text)))

================================================================================
Example 144 - https://github.github.com/gfm/#example-144
================================================================================
- <div>
- foo

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (html_block
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 145 - https://github.github.com/gfm/#example-145
================================================================================
<style>p{color:red;}</style>
*foo*

--------------------------------------------------------------------------------

(document
  (html_block
    (text))
  (paragraph
    (emphasis
      (text))))

================================================================================
Example 146 - https://github.github.com/gfm/#example-146
================================================================================
<!-- foo -->*bar*
*baz*

--------------------------------------------------------------------------------

(document
  (html_block
    (text))
  (paragraph
    (emphasis
      (text))))

================================================================================
Example 147 - https://github.github.com/gfm/#example-147
================================================================================
<script>
foo
</script>1. *bar*

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 148 - https://github.github.com/gfm/#example-148
================================================================================
<!-- Foo

bar
   baz -->
okay

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (line_break)
    (text)
    (line_break)
    (text))
  (paragraph
    (text)))

================================================================================
Example 149 - https://github.github.com/gfm/#example-149
================================================================================
<?php

  echo '>';

?>
okay

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (line_break)
    (text)
    (line_break)
    (line_break)
    (text))
  (paragraph
    (text)))

================================================================================
Example 150 - https://github.github.com/gfm/#example-150
================================================================================
<!DOCTYPE html>

--------------------------------------------------------------------------------

(document
  (html_block
    (text)))

================================================================================
Example 151 - https://github.github.com/gfm/#example-151
================================================================================
<![CDATA[
function matchwo(a,b)
{
  if (a < b && a < 0) then {
    return 1;

  } else {

    return 0;
  }
}
]]>
okay

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)
    (line_break)
    (text)
    (line_break)
    (text)
    (line_break)
    (line_break)
    (text)
    (line_break)
    (line_break)
    (text)
    (line_break)
    (text)
    (line_break)
    (text)
    (line_break)
    (text))
  (paragraph
    (text)))

================================================================================
Example 152 - https://github.github.com/gfm/#example-152
================================================================================
  <!-- foo -->

    <!-- foo -->

--------------------------------------------------------------------------------

(document
  (html_block
    (text))
  (indented_code_block
    (text)))

================================================================================
Example 153 - https://github.github.com/gfm/#example-153
================================================================================
  <div>

    <div>

--------------------------------------------------------------------------------

(document
  (html_block
    (text))
  (indented_code_block
    (text)))

================================================================================
Example 154 - https://github.github.com/gfm/#example-154
================================================================================
Foo
<div>
bar
</div>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 155 - https://github.github.com/gfm/#example-155
================================================================================
<div>
bar
</div>
*foo*

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 156 - https://github.github.com/gfm/#example-156
================================================================================
Foo
<a href="bar">
baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (html_open_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text))))
    (soft_line_break)
    (text)))

================================================================================
Example 157 - https://github.github.com/gfm/#example-157
================================================================================
<div>

*Emphasized* text.

</div>

--------------------------------------------------------------------------------

(document
  (html_block
    (text))
  (paragraph
    (emphasis
      (text))
    (text))
  (html_block
    (text)))

================================================================================
Example 158 - https://github.github.com/gfm/#example-158
================================================================================
<div>
*Emphasized* text.
</div>

--------------------------------------------------------------------------------

(document
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 159 - https://github.github.com/gfm/#example-159
================================================================================
<table>

<tr>

<td>
Hi
</td>

</tr>

</table>

--------------------------------------------------------------------------------

(document
  (html_block
    (text))
  (html_block
    (text))
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text))
  (html_block
    (text))
  (html_block
    (text)))

================================================================================
Example 160 - https://github.github.com/gfm/#example-160
================================================================================
<table>

  <tr>

    <td>
      Hi
    </td>

  </tr>

</table>

--------------------------------------------------------------------------------

(document
  (html_block
    (text))
  (html_block
    (text))
  (indented_code_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text))
  (html_block
    (text))
  (html_block
    (text)))

================================================================================
Example 161 - https://github.github.com/gfm/#example-161
================================================================================
[foo]: /url "title"

[foo]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text)))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 162 - https://github.github.com/gfm/#example-162
================================================================================
   [foo]: 
      /url  
           'the title'  

[foo]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text)))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 163 - https://github.github.com/gfm/#example-163
================================================================================
[Foo*bar\]]:my_(url) 'title (with parens)'

[Foo*bar\]]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text)
      (backslash_escape))
    (link_destination
      (text))
    (link_title
      (text)))
  (paragraph
    (link
      (link_text
        (text)
        (backslash_escape)))))

================================================================================
Example 164 - https://github.github.com/gfm/#example-164
================================================================================
[Foo bar]:
<my url>
'title'

[Foo bar]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text)))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 165 - https://github.github.com/gfm/#example-165
================================================================================
[foo]: /url '
title
line1
line2
'

[foo]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text)))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 166 - https://github.github.com/gfm/#example-166
================================================================================
[foo]: /url 'title

with blank line'

[foo]

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text))
  (paragraph
    (text))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 167 - https://github.github.com/gfm/#example-167
================================================================================
[foo]:
/url

[foo]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 168 - https://github.github.com/gfm/#example-168
================================================================================
[foo]:

[foo]

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 169 - https://github.github.com/gfm/#example-169
================================================================================
[foo]: <>

[foo]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 170 - https://github.github.com/gfm/#example-170
================================================================================
[foo]: <bar>(baz)

[foo]

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text)
    (html_open_tag
      (html_tag_name))
    (text))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 171 - https://github.github.com/gfm/#example-171
================================================================================
[foo]: /url\bar\*baz "foo\"bar\baz"

[foo]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)
      (backslash_escape)
      (text))
    (link_title
      (text)
      (backslash_escape)
      (text)))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 172 - https://github.github.com/gfm/#example-172
================================================================================
[foo]

[foo]: url

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 173 - https://github.github.com/gfm/#example-173
================================================================================
[foo]

[foo]: first
[foo]: second

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 174 - https://github.github.com/gfm/#example-174
================================================================================
[FOO]: /url

[Foo]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 175 - https://github.github.com/gfm/#example-175
================================================================================
[ΑΓΩ]: /φου

[αγω]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 176 - https://github.github.com/gfm/#example-176
================================================================================
[foo]: /url

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 177 - https://github.github.com/gfm/#example-177
================================================================================
[
foo
]: /url
bar

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (paragraph
    (text)))

================================================================================
Example 178 - https://github.github.com/gfm/#example-178
================================================================================
[foo]: /url "title" ok

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text)))

================================================================================
Example 179 - https://github.github.com/gfm/#example-179
================================================================================
[foo]: /url
"title" ok

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (paragraph
    (text)))

================================================================================
Example 180 - https://github.github.com/gfm/#example-180
================================================================================
    [foo]: /url "title"

[foo]

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 181 - https://github.github.com/gfm/#example-181
================================================================================
```
[foo]: /url
```

[foo]

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text)))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 182 - https://github.github.com/gfm/#example-182
================================================================================
Foo
[bar]: /baz

[bar]

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (link
      (link_text
        (text)))
    (text))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 183 - https://github.github.com/gfm/#example-183
================================================================================
# [Foo]
[foo]: /url
> bar

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text)
      (link
        (link_text
          (text)))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (block_quote
    (paragraph
      (text))))

================================================================================
Example 184 - https://github.github.com/gfm/#example-184
================================================================================
[foo]: /url
bar
===
[foo]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (setext_heading
    (heading_content
      (text))
    (setext_heading_underline))
  (paragraph
    (link
      (link_text
        (text)))))

================================================================================
Example 185 - https://github.github.com/gfm/#example-185
================================================================================
[foo]: /url
===
[foo]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (paragraph
    (text)
    (soft_line_break)
    (link
      (link_text
        (text)))))

================================================================================
Example 186 - https://github.github.com/gfm/#example-186
================================================================================
[foo]: /foo-url "foo"
[bar]: /bar-url
  "bar"
[baz]: /baz-url

[foo],
[bar],
[baz]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text)))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text)))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (paragraph
    (link
      (link_text
        (text)))
    (text)
    (soft_line_break)
    (link
      (link_text
        (text)))
    (text)
    (soft_line_break)
    (link
      (link_text
        (text)))))

================================================================================
Example 187 - https://github.github.com/gfm/#example-187
================================================================================
[foo]

> [foo]: /url

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))))
  (block_quote
    (link_reference_definition
      (link_label
        (text))
      (link_destination
        (text)))))

================================================================================
Example 188 - https://github.github.com/gfm/#example-188
================================================================================
[foo]: /url

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 189 - https://github.github.com/gfm/#example-189
================================================================================
aaa

bbb

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (paragraph
    (text)))

================================================================================
Example 190 - https://github.github.com/gfm/#example-190
================================================================================
aaa
bbb

ccc
ddd

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text))
  (paragraph
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 191 - https://github.github.com/gfm/#example-191
================================================================================
aaa


bbb

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (paragraph
    (text)))

================================================================================
Example 192 - https://github.github.com/gfm/#example-192
================================================================================
  aaa
 bbb

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 193 - https://github.github.com/gfm/#example-193
================================================================================
aaa
             bbb
                                       ccc

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 194 - https://github.github.com/gfm/#example-194
================================================================================
   aaa
bbb

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 195 - https://github.github.com/gfm/#example-195
================================================================================
    aaa
bbb

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text))
  (paragraph
    (text)))

================================================================================
Example 196 - https://github.github.com/gfm/#example-196
================================================================================
aaa     
bbb     

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (hard_line_break)
    (text)))

================================================================================
Example 197 - https://github.github.com/gfm/#example-197
================================================================================
  

aaa
  

# aaa

  

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text))))

================================================================================
Example 198 - https://github.github.com/gfm/#example-198
================================================================================
| foo | bar |
| --- | --- |
| baz | bim |

--------------------------------------------------------------------------------

(document
  (table
    (table_header_row
      (table_cell
        (text))
      (table_cell
        (text)))
    (table_delimiter_row
      (table_column_alignment)
      (table_column_alignment))
    (table_data_row
      (table_cell
        (text))
      (table_cell
        (text)))))

================================================================================
Example 199 - https://github.github.com/gfm/#example-199
================================================================================
| abc | defghi |
:-: | -----------:
bar | baz

--------------------------------------------------------------------------------

(document
  (table
    (table_header_row
      (table_cell
        (text))
      (table_cell
        (text)))
    (table_delimiter_row
      (table_column_alignment)
      (table_column_alignment))
    (table_data_row
      (table_cell
        (text))
      (table_cell
        (text)))))

================================================================================
Example 200 - https://github.github.com/gfm/#example-200
================================================================================
| f\|oo  |
| ------ |
| b `\|` az |
| b **\|** im |

--------------------------------------------------------------------------------

(document
  (table
    (table_header_row
      (table_cell
        (text)
        (backslash_escape)
        (text)))
    (table_delimiter_row
      (table_column_alignment))
    (table_data_row
      (table_cell
        (text)
        (code_span
          (backslash_escape))
        (text)))
    (table_data_row
      (table_cell
        (text)
        (strong_emphasis
          (backslash_escape))
        (text)))))

================================================================================
Example 201 - https://github.github.com/gfm/#example-201
================================================================================
| abc | def |
| --- | --- |
| bar | baz |
> bar

--------------------------------------------------------------------------------

(document
  (table
    (table_header_row
      (table_cell
        (text))
      (table_cell
        (text)))
    (table_delimiter_row
      (table_column_alignment)
      (table_column_alignment))
    (table_data_row
      (table_cell
        (text))
      (table_cell
        (text))))
  (block_quote
    (paragraph
      (text))))

================================================================================
Example 202 - https://github.github.com/gfm/#example-202
================================================================================
| abc | def |
| --- | --- |
| bar | baz |
bar

bar

--------------------------------------------------------------------------------

(document
  (table
    (table_header_row
      (table_cell
        (text))
      (table_cell
        (text)))
    (table_delimiter_row
      (table_column_alignment)
      (table_column_alignment))
    (table_data_row
      (table_cell
        (text))
      (table_cell
        (text)))
    (table_data_row
      (table_cell
        (text))))
  (paragraph
    (text)))

================================================================================
Example 203 - https://github.github.com/gfm/#example-203
================================================================================
| abc | def |
| --- |
| bar |

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 204 - https://github.github.com/gfm/#example-204
================================================================================
| abc | def |
| --- | --- |
| bar |
| bar | baz | boo |

--------------------------------------------------------------------------------

(document
  (table
    (table_header_row
      (table_cell
        (text))
      (table_cell
        (text)))
    (table_delimiter_row
      (table_column_alignment)
      (table_column_alignment))
    (table_data_row
      (table_cell
        (text)))
    (table_data_row
      (table_cell
        (text))
      (table_cell
        (text))
      (table_cell
        (text)))))

================================================================================
Example 205 - https://github.github.com/gfm/#example-205
================================================================================
| abc | def |
| --- | --- |

--------------------------------------------------------------------------------

(document
  (table
    (table_header_row
      (table_cell
        (text))
      (table_cell
        (text)))
    (table_delimiter_row
      (table_column_alignment)
      (table_column_alignment))))

================================================================================
Example 206 - https://github.github.com/gfm/#example-206
================================================================================
> # Foo
> bar
> baz

--------------------------------------------------------------------------------

(document
  (block_quote
    (atx_heading
      (atx_heading_marker)
      (heading_content
        (text)))
    (paragraph
      (text)
      (soft_line_break)
      (text))))

================================================================================
Example 207 - https://github.github.com/gfm/#example-207
================================================================================
># Foo
>bar
> baz

--------------------------------------------------------------------------------

(document
  (block_quote
    (atx_heading
      (atx_heading_marker)
      (heading_content
        (text)))
    (paragraph
      (text)
      (soft_line_break)
      (text))))

================================================================================
Example 208 - https://github.github.com/gfm/#example-208
================================================================================
   > # Foo
   > bar
 > baz

--------------------------------------------------------------------------------

(document
  (block_quote
    (atx_heading
      (atx_heading_marker)
      (heading_content
        (text)))
    (paragraph
      (text)
      (soft_line_break)
      (text))))

================================================================================
Example 209 - https://github.github.com/gfm/#example-209
================================================================================
    > # Foo
    > bar
    > baz

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 210 - https://github.github.com/gfm/#example-210
================================================================================
> # Foo
> bar
baz

--------------------------------------------------------------------------------

(document
  (block_quote
    (atx_heading
      (atx_heading_marker)
      (heading_content
        (text)))
    (paragraph
      (text)
      (soft_line_break)
      (text))))

================================================================================
Example 211 - https://github.github.com/gfm/#example-211
================================================================================
> bar
baz
> foo

--------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph
      (text)
      (soft_line_break)
      (text)
      (soft_line_break)
      (text))))

================================================================================
Example 212 - https://github.github.com/gfm/#example-212
================================================================================
> foo
---

--------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph
      (text)))
  (thematic_break))

================================================================================
Example 213 - https://github.github.com/gfm/#example-213
================================================================================
> - foo
- bar

--------------------------------------------------------------------------------

(document
  (block_quote
    (tight_list
      (list_item
        (list_marker)
        (paragraph
          (text)))))
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 214 - https://github.github.com/gfm/#example-214
================================================================================
>     foo
    bar

--------------------------------------------------------------------------------

(document
  (block_quote
    (indented_code_block
      (text)))
  (indented_code_block
    (text)))

================================================================================
Example 215 - https://github.github.com/gfm/#example-215
================================================================================
> ```
foo
```

--------------------------------------------------------------------------------

(document
  (block_quote
    (fenced_code_block))
  (paragraph
    (text))
  (fenced_code_block))

================================================================================
Example 216 - https://github.github.com/gfm/#example-216
================================================================================
> foo
    - bar

--------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph
      (text)
      (soft_line_break)
      (text))))

================================================================================
Example 217 - https://github.github.com/gfm/#example-217
================================================================================
>

--------------------------------------------------------------------------------

(document
  (block_quote))

================================================================================
Example 218 - https://github.github.com/gfm/#example-218
================================================================================
>
>  
> 

--------------------------------------------------------------------------------

(document
  (block_quote))

================================================================================
Example 219 - https://github.github.com/gfm/#example-219
================================================================================
>
> foo
>  

--------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph
      (text))))

================================================================================
Example 220 - https://github.github.com/gfm/#example-220
================================================================================
> foo

> bar

--------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph
      (text)))
  (block_quote
    (paragraph
      (text))))

================================================================================
Example 221 - https://github.github.com/gfm/#example-221
================================================================================
> foo
> bar

--------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph
      (text)
      (soft_line_break)
      (text))))

================================================================================
Example 222 - https://github.github.com/gfm/#example-222
================================================================================
> foo
>
> bar

--------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph
      (text))
    (paragraph
      (text))))

================================================================================
Example 223 - https://github.github.com/gfm/#example-223
================================================================================
foo
> bar

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (block_quote
    (paragraph
      (text))))

================================================================================
Example 224 - https://github.github.com/gfm/#example-224
================================================================================
> aaa
***
> bbb

--------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph
      (text)))
  (thematic_break)
  (block_quote
    (paragraph
      (text))))

================================================================================
Example 225 - https://github.github.com/gfm/#example-225
================================================================================
> bar
baz

--------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph
      (text)
      (soft_line_break)
      (text))))

================================================================================
Example 226 - https://github.github.com/gfm/#example-226
================================================================================
> bar

baz

--------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph
      (text)))
  (paragraph
    (text)))

================================================================================
Example 227 - https://github.github.com/gfm/#example-227
================================================================================
> bar
>
baz

--------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph
      (text)))
  (paragraph
    (text)))

================================================================================
Example 228 - https://github.github.com/gfm/#example-228
================================================================================
> > > foo
bar

--------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote
      (block_quote
        (paragraph
          (text)
          (soft_line_break)
          (text))))))

================================================================================
Example 229 - https://github.github.com/gfm/#example-229
================================================================================
>>> foo
> bar
>>baz

--------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote
      (block_quote
        (paragraph
          (text)
          (soft_line_break)
          (text)
          (soft_line_break)
          (text))))))

================================================================================
Example 230 - https://github.github.com/gfm/#example-230
================================================================================
>     code

>    not code

--------------------------------------------------------------------------------

(document
  (block_quote
    (indented_code_block
      (text)))
  (block_quote
    (paragraph
      (text))))

================================================================================
Example 231 - https://github.github.com/gfm/#example-231
================================================================================
A paragraph
with two lines.

    indented code

> A block quote.

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text))
  (indented_code_block
    (text))
  (block_quote
    (paragraph
      (text))))

================================================================================
Example 232 - https://github.github.com/gfm/#example-232
================================================================================
1.  A paragraph
    with two lines.

        indented code

    > A block quote.

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text)
        (soft_line_break)
        (text))
      (indented_code_block
        (text))
      (block_quote
        (paragraph
          (text))))))

================================================================================
Example 233 - https://github.github.com/gfm/#example-233
================================================================================
- one

 two

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))))
  (paragraph
    (text)))

================================================================================
Example 234 - https://github.github.com/gfm/#example-234
================================================================================
- one

  two

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (paragraph
        (text)))))

================================================================================
Example 235 - https://github.github.com/gfm/#example-235
================================================================================
 -    one

     two

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))))
  (indented_code_block
    (text)))

================================================================================
Example 236 - https://github.github.com/gfm/#example-236
================================================================================
 -    one

      two

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (paragraph
        (text)))))

================================================================================
Example 237 - https://github.github.com/gfm/#example-237
================================================================================
   > > 1.  one
>>
>>     two

--------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote
      (loose_list
        (list_item
          (list_marker)
          (paragraph
            (text))
          (paragraph
            (text)))))))

================================================================================
Example 238 - https://github.github.com/gfm/#example-238
================================================================================
>>- one
>>
  >  > two

--------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote
      (tight_list
        (list_item
          (list_marker)
          (paragraph
            (text))))
      (paragraph
        (text)))))

================================================================================
Example 239 - https://github.github.com/gfm/#example-239
================================================================================
-one

2.two

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (paragraph
    (text)))

================================================================================
Example 240 - https://github.github.com/gfm/#example-240
================================================================================
- foo


  bar

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (paragraph
        (text)))))

================================================================================
Example 241 - https://github.github.com/gfm/#example-241
================================================================================
1.  foo

    ```
    bar
    ```

    baz

    > bam

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (fenced_code_block
        (code_fence_content
          (text)))
      (paragraph
        (text))
      (block_quote
        (paragraph
          (text))))))

================================================================================
Example 242 - https://github.github.com/gfm/#example-242
================================================================================
- Foo

      bar


      baz

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (indented_code_block
        (text)
        (line_break)
        (line_break)
        (line_break)
        (text)))))

================================================================================
Example 243 - https://github.github.com/gfm/#example-243
================================================================================
123456789. ok

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 244 - https://github.github.com/gfm/#example-244
================================================================================
1234567890. not ok

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 245 - https://github.github.com/gfm/#example-245
================================================================================
0. ok

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 246 - https://github.github.com/gfm/#example-246
================================================================================
003. ok

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 247 - https://github.github.com/gfm/#example-247
================================================================================
-1. not ok

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 248 - https://github.github.com/gfm/#example-248
================================================================================
- foo

      bar

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (indented_code_block
        (text)))))

================================================================================
Example 249 - https://github.github.com/gfm/#example-249
================================================================================
  10.  foo

           bar

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (indented_code_block
        (text)))))

================================================================================
Example 250 - https://github.github.com/gfm/#example-250
================================================================================
    indented code

paragraph

    more code

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text))
  (paragraph
    (text))
  (indented_code_block
    (text)))

================================================================================
Example 251 - https://github.github.com/gfm/#example-251
================================================================================
1.     indented code

   paragraph

       more code

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (indented_code_block
        (text))
      (paragraph
        (text))
      (indented_code_block
        (text)))))

================================================================================
Example 252 - https://github.github.com/gfm/#example-252
================================================================================
1.      indented code

   paragraph

       more code

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (indented_code_block
        (text))
      (paragraph
        (text))
      (indented_code_block
        (text)))))

================================================================================
Example 253 - https://github.github.com/gfm/#example-253
================================================================================
   foo

bar

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (paragraph
    (text)))

================================================================================
Example 254 - https://github.github.com/gfm/#example-254
================================================================================
-    foo

  bar

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))))
  (paragraph
    (text)))

================================================================================
Example 255 - https://github.github.com/gfm/#example-255
================================================================================
-  foo

   bar

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (paragraph
        (text)))))

================================================================================
Example 256 - https://github.github.com/gfm/#example-256
================================================================================
-
  foo
-
  ```
  bar
  ```
-
      baz

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (fenced_code_block
        (code_fence_content
          (text))))
    (list_item
      (list_marker)
      (indented_code_block
        (text)))))

================================================================================
Example 257 - https://github.github.com/gfm/#example-257
================================================================================
-   
  foo

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 258 - https://github.github.com/gfm/#example-258
================================================================================
-

  foo

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)))
  (paragraph
    (text)))

================================================================================
Example 259 - https://github.github.com/gfm/#example-259
================================================================================
- foo
-
- bar

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 260 - https://github.github.com/gfm/#example-260
================================================================================
- foo
-   
- bar

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 261 - https://github.github.com/gfm/#example-261
================================================================================
1. foo
2.
3. bar

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 262 - https://github.github.com/gfm/#example-262
================================================================================
*

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker))))

================================================================================
Example 263 - https://github.github.com/gfm/#example-263
================================================================================
foo
*

foo
1.

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text))
  (paragraph
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 264 - https://github.github.com/gfm/#example-264
================================================================================
 1.  A paragraph
     with two lines.

         indented code

     > A block quote.

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text)
        (soft_line_break)
        (text))
      (indented_code_block
        (text))
      (block_quote
        (paragraph
          (text))))))

================================================================================
Example 265 - https://github.github.com/gfm/#example-265
================================================================================
  1.  A paragraph
      with two lines.

          indented code

      > A block quote.

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text)
        (soft_line_break)
        (text))
      (indented_code_block
        (text))
      (block_quote
        (paragraph
          (text))))))

================================================================================
Example 266 - https://github.github.com/gfm/#example-266
================================================================================
   1.  A paragraph
       with two lines.

           indented code

       > A block quote.

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text)
        (soft_line_break)
        (text))
      (indented_code_block
        (text))
      (block_quote
        (paragraph
          (text))))))

================================================================================
Example 267 - https://github.github.com/gfm/#example-267
================================================================================
    1.  A paragraph
        with two lines.

            indented code

        > A block quote.

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)
    (line_break)
    (text)
    (line_break)
    (line_break)
    (text)
    (line_break)
    (line_break)
    (text)))

================================================================================
Example 268 - https://github.github.com/gfm/#example-268
================================================================================
  1.  A paragraph
with two lines.

          indented code

      > A block quote.

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text)
        (soft_line_break)
        (text))
      (indented_code_block
        (text))
      (block_quote
        (paragraph
          (text))))))

================================================================================
Example 269 - https://github.github.com/gfm/#example-269
================================================================================
  1.  A paragraph
    with two lines.

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)
        (soft_line_break)
        (text)))))

================================================================================
Example 270 - https://github.github.com/gfm/#example-270
================================================================================
> 1. > Blockquote
continued here.

--------------------------------------------------------------------------------

(document
  (block_quote
    (tight_list
      (list_item
        (list_marker)
        (block_quote
          (paragraph
            (text)
            (soft_line_break)
            (text)))))))

================================================================================
Example 271 - https://github.github.com/gfm/#example-271
================================================================================
> 1. > Blockquote
> continued here.

--------------------------------------------------------------------------------

(document
  (block_quote
    (tight_list
      (list_item
        (list_marker)
        (block_quote
          (paragraph
            (text)
            (soft_line_break)
            (text)))))))

================================================================================
Example 272 - https://github.github.com/gfm/#example-272
================================================================================
- foo
  - bar
    - baz
      - boo

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (tight_list
        (list_item
          (list_marker)
          (paragraph
            (text))
          (tight_list
            (list_item
              (list_marker)
              (paragraph
                (text))
              (tight_list
                (list_item
                  (list_marker)
                  (paragraph
                    (text)))))))))))

================================================================================
Example 273 - https://github.github.com/gfm/#example-273
================================================================================
- foo
 - bar
  - baz
   - boo

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 274 - https://github.github.com/gfm/#example-274
================================================================================
10) foo
    - bar

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (tight_list
        (list_item
          (list_marker)
          (paragraph
            (text)))))))

================================================================================
Example 275 - https://github.github.com/gfm/#example-275
================================================================================
10) foo
   - bar

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))))
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 276 - https://github.github.com/gfm/#example-276
================================================================================
- - foo

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (tight_list
        (list_item
          (list_marker)
          (paragraph
            (text)))))))

================================================================================
Example 277 - https://github.github.com/gfm/#example-277
================================================================================
1. - 2. foo

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (tight_list
        (list_item
          (list_marker)
          (tight_list
            (list_item
              (list_marker)
              (paragraph
                (text)))))))))

================================================================================
Example 278 - https://github.github.com/gfm/#example-278
================================================================================
- # Foo
- Bar
  ---
  baz

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (atx_heading
        (atx_heading_marker)
        (heading_content
          (text))))
    (list_item
      (list_marker)
      (setext_heading
        (heading_content
          (text))
        (setext_heading_underline))
      (paragraph
        (text)))))

================================================================================
Example 279 - https://github.github.com/gfm/#example-279
================================================================================
- [ ] foo
- [x] bar

--------------------------------------------------------------------------------

(document
  (tight_list
    (task_list_item
      (list_marker)
      (paragraph
        (task_list_item_marker)
        (text)))
    (task_list_item
      (list_marker)
      (paragraph
        (task_list_item_marker)
        (text)))))

================================================================================
Example 280 - https://github.github.com/gfm/#example-280
================================================================================
- [x] foo
  - [ ] bar
  - [x] baz
- [ ] bim

--------------------------------------------------------------------------------

(document
  (tight_list
    (task_list_item
      (list_marker)
      (paragraph
        (task_list_item_marker)
        (text))
      (tight_list
        (task_list_item
          (list_marker)
          (paragraph
            (task_list_item_marker)
            (text)))
        (task_list_item
          (list_marker)
          (paragraph
            (task_list_item_marker)
            (text)))))
    (task_list_item
      (list_marker)
      (paragraph
        (task_list_item_marker)
        (text)))))

================================================================================
Example 281 - https://github.github.com/gfm/#example-281
================================================================================
- foo
- bar
+ baz

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text))))
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 282 - https://github.github.com/gfm/#example-282
================================================================================
1. foo
2. bar
3) baz

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text))))
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 283 - https://github.github.com/gfm/#example-283
================================================================================
Foo
- bar
- baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 284 - https://github.github.com/gfm/#example-284
================================================================================
The number of windows in my house is
14.  The number of doors is 6.

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 285 - https://github.github.com/gfm/#example-285
================================================================================
The number of windows in my house is
1.  The number of doors is 6.

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 286 - https://github.github.com/gfm/#example-286
================================================================================
- foo

- bar


- baz

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 287 - https://github.github.com/gfm/#example-287
================================================================================
- foo
  - bar
    - baz


      bim

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (tight_list
        (list_item
          (list_marker)
          (paragraph
            (text))
          (loose_list
            (list_item
              (list_marker)
              (paragraph
                (text))
              (paragraph
                (text)))))))))

================================================================================
Example 288 - https://github.github.com/gfm/#example-288
================================================================================
- foo
- bar

<!-- -->

- baz
- bim

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text))))
  (html_block
    (text))
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 289 - https://github.github.com/gfm/#example-289
================================================================================
-   foo

    notcode

-   foo

<!-- -->

    code

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text))))
  (html_block
    (text))
  (indented_code_block
    (text)))

================================================================================
Example 290 - https://github.github.com/gfm/#example-290
================================================================================
- a
 - b
  - c
   - d
  - e
 - f
- g

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 291 - https://github.github.com/gfm/#example-291
================================================================================
1. a

  2. b

   3. c

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 292 - https://github.github.com/gfm/#example-292
================================================================================
- a
 - b
  - c
   - d
    - e

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)
        (soft_line_break)
        (text)))))

================================================================================
Example 293 - https://github.github.com/gfm/#example-293
================================================================================
1. a

  2. b

    3. c

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text))))
  (indented_code_block
    (text)))

================================================================================
Example 294 - https://github.github.com/gfm/#example-294
================================================================================
- a
- b

- c

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 295 - https://github.github.com/gfm/#example-295
================================================================================
* a
*

* c

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 296 - https://github.github.com/gfm/#example-296
================================================================================
- a
- b

  c
- d

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text))
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 297 - https://github.github.com/gfm/#example-297
================================================================================
- a
- b

  [ref]: /url
- d

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (paragraph
        (text))
      (link_reference_definition
        (link_label
          (text))
        (link_destination
          (text))))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 298 - https://github.github.com/gfm/#example-298
================================================================================
- a
- ```
  b


  ```
- c

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))
    (list_item
      (list_marker)
      (fenced_code_block
        (code_fence_content
          (text)
          (line_break)
          (line_break))))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 299 - https://github.github.com/gfm/#example-299
================================================================================
- a
  - b

    c
- d

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (loose_list
        (list_item
          (list_marker)
          (paragraph
            (text))
          (paragraph
            (text)))))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 300 - https://github.github.com/gfm/#example-300
================================================================================
* a
  > b
  >
* c

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (block_quote
        (paragraph
          (text))))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 301 - https://github.github.com/gfm/#example-301
================================================================================
- a
  > b
  ```
  c
  ```
- d

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (block_quote
        (paragraph
          (text)))
      (fenced_code_block
        (code_fence_content
          (text))))
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 302 - https://github.github.com/gfm/#example-302
================================================================================
- a

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 303 - https://github.github.com/gfm/#example-303
================================================================================
- a
  - b

--------------------------------------------------------------------------------

(document
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (tight_list
        (list_item
          (list_marker)
          (paragraph
            (text)))))))

================================================================================
Example 304 - https://github.github.com/gfm/#example-304
================================================================================
1. ```
   foo
   ```

   bar

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (fenced_code_block
        (code_fence_content
          (text)))
      (paragraph
        (text)))))

================================================================================
Example 305 - https://github.github.com/gfm/#example-305
================================================================================
* foo
  * bar

  baz

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (tight_list
        (list_item
          (list_marker)
          (paragraph
            (text))))
      (paragraph
        (text)))))

================================================================================
Example 306 - https://github.github.com/gfm/#example-306
================================================================================
- a
  - b
  - c

- d
  - e
  - f

--------------------------------------------------------------------------------

(document
  (loose_list
    (list_item
      (list_marker)
      (paragraph
        (text))
      (tight_list
        (list_item
          (list_marker)
          (paragraph
            (text)))
        (list_item
          (list_marker)
          (paragraph
            (text)))))
    (list_item
      (list_marker)
      (paragraph
        (text))
      (tight_list
        (list_item
          (list_marker)
          (paragraph
            (text)))
        (list_item
          (list_marker)
          (paragraph
            (text)))))))

================================================================================
Example 307 - https://github.github.com/gfm/#example-307
================================================================================
`hi`lo`

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))
    (text)))

================================================================================
Example 308 - https://github.github.com/gfm/#example-308
================================================================================
\!\"\#\$\%\&\'\(\)\*\+\,\-\.\/\:\;\<\=\>\?\@\[\\\]\^\_\`\{\|\}\~

--------------------------------------------------------------------------------

(document
  (paragraph
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)
    (backslash_escape)))

================================================================================
Example 309 - https://github.github.com/gfm/#example-309
================================================================================
\	\A\a\ \3\φ\«

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 310 - https://github.github.com/gfm/#example-310
================================================================================
\*not emphasized*
\<br/> not a tag
\[not a link](/foo)
\`not code`
1\. not a list
\* not a list
\# not a heading
\[foo]: /url "not a reference"
\&ouml; not a character entity

--------------------------------------------------------------------------------

(document
  (paragraph
    (backslash_escape)
    (text)
    (soft_line_break)
    (backslash_escape)
    (text)
    (soft_line_break)
    (backslash_escape)
    (text)
    (soft_line_break)
    (backslash_escape)
    (text)
    (soft_line_break)
    (text)
    (backslash_escape)
    (text)
    (soft_line_break)
    (backslash_escape)
    (text)
    (soft_line_break)
    (backslash_escape)
    (text)
    (soft_line_break)
    (backslash_escape)
    (text)
    (soft_line_break)
    (backslash_escape)
    (text)))

================================================================================
Example 311 - https://github.github.com/gfm/#example-311
================================================================================
\\*emphasis*

--------------------------------------------------------------------------------

(document
  (paragraph
    (backslash_escape)
    (emphasis
      (text))))

================================================================================
Example 312 - https://github.github.com/gfm/#example-312
================================================================================
foo\
bar

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (hard_line_break)
    (text)))

================================================================================
Example 313 - https://github.github.com/gfm/#example-313
================================================================================
`` \[\` ``

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 314 - https://github.github.com/gfm/#example-314
================================================================================
    \[\]

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)))

================================================================================
Example 315 - https://github.github.com/gfm/#example-315
================================================================================
~~~
\[\]
~~~

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (code_fence_content
      (text))))

================================================================================
Example 316 - https://github.github.com/gfm/#example-316
================================================================================
<http://example.com?find=\*>

--------------------------------------------------------------------------------

(document
  (paragraph
    (uri_autolink
      (text))))

================================================================================
Example 317 - https://github.github.com/gfm/#example-317
================================================================================
<a href="/bar\/)">

--------------------------------------------------------------------------------

(document
  (html_block
    (text)))

================================================================================
Example 318 - https://github.github.com/gfm/#example-318
================================================================================
[foo](/bar\* "ti\*tle")

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)
        (backslash_escape))
      (link_title
        (text)
        (backslash_escape)
        (text)))))

================================================================================
Example 319 - https://github.github.com/gfm/#example-319
================================================================================
[foo]

[foo]: /bar\* "ti\*tle"

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)
      (backslash_escape))
    (link_title
      (text)
      (backslash_escape)
      (text))))

================================================================================
Example 320 - https://github.github.com/gfm/#example-320
================================================================================
``` foo\+bar
foo
```

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (info_string
      (text)
      (backslash_escape)
      (text))
    (code_fence_content
      (text))))

================================================================================
Example 321 - https://github.github.com/gfm/#example-321
================================================================================
&nbsp; &amp; &copy; &AElig; &Dcaron;
&frac34; &HilbertSpace; &DifferentialD;
&ClockwiseContourIntegral; &ngE;

--------------------------------------------------------------------------------

(document
  (paragraph
    (character_reference)
    (text)
    (character_reference)
    (text)
    (character_reference)
    (text)
    (character_reference)
    (text)
    (character_reference)
    (soft_line_break)
    (character_reference)
    (text)
    (character_reference)
    (text)
    (character_reference)
    (soft_line_break)
    (character_reference)
    (text)
    (character_reference)))

================================================================================
Example 322 - https://github.github.com/gfm/#example-322
================================================================================
&#35; &#1234; &#992; &#0;

--------------------------------------------------------------------------------

(document
  (paragraph
    (character_reference)
    (text)
    (character_reference)
    (text)
    (character_reference)
    (text)
    (character_reference)))

================================================================================
Example 323 - https://github.github.com/gfm/#example-323
================================================================================
&#X22; &#XD06; &#xcab;

--------------------------------------------------------------------------------

(document
  (paragraph
    (character_reference)
    (text)
    (character_reference)
    (text)
    (character_reference)))

================================================================================
Example 324 - https://github.github.com/gfm/#example-324
================================================================================
&nbsp &x; &#; &#x;
&#87654321;
&#abcdef0;
&ThisIsNotDefined; &hi?;

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)
    (soft_line_break)
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 325 - https://github.github.com/gfm/#example-325
================================================================================
&copy

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 326 - https://github.github.com/gfm/#example-326
================================================================================
&MadeUpEntity;

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 327 - https://github.github.com/gfm/#example-327
================================================================================
<a href="&ouml;&ouml;.html">

--------------------------------------------------------------------------------

(document
  (html_block
    (text)))

================================================================================
Example 328 - https://github.github.com/gfm/#example-328
================================================================================
[foo](/f&ouml;&ouml; "f&ouml;&ouml;")

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)
        (character_reference)
        (character_reference))
      (link_title
        (text)
        (character_reference)
        (character_reference)))))

================================================================================
Example 329 - https://github.github.com/gfm/#example-329
================================================================================
[foo]

[foo]: /f&ouml;&ouml; "f&ouml;&ouml;"

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)
      (character_reference)
      (character_reference))
    (link_title
      (text)
      (character_reference)
      (character_reference))))

================================================================================
Example 330 - https://github.github.com/gfm/#example-330
================================================================================
``` f&ouml;&ouml;
foo
```

--------------------------------------------------------------------------------

(document
  (fenced_code_block
    (info_string
      (text)
      (character_reference)
      (character_reference))
    (code_fence_content
      (text))))

================================================================================
Example 331 - https://github.github.com/gfm/#example-331
================================================================================
`f&ouml;&ouml;`

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 332 - https://github.github.com/gfm/#example-332
================================================================================
    f&ouml;f&ouml;

--------------------------------------------------------------------------------

(document
  (indented_code_block
    (text)))

================================================================================
Example 333 - https://github.github.com/gfm/#example-333
================================================================================
&#42;foo&#42;
*foo*

--------------------------------------------------------------------------------

(document
  (paragraph
    (character_reference)
    (text)
    (character_reference)
    (soft_line_break)
    (emphasis
      (text))))

================================================================================
Example 334 - https://github.github.com/gfm/#example-334
================================================================================
&#42; foo

* foo

--------------------------------------------------------------------------------

(document
  (paragraph
    (character_reference)
    (text))
  (tight_list
    (list_item
      (list_marker)
      (paragraph
        (text)))))

================================================================================
Example 335 - https://github.github.com/gfm/#example-335
================================================================================
foo&#10;&#10;bar

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (character_reference)
    (character_reference)
    (text)))

================================================================================
Example 336 - https://github.github.com/gfm/#example-336
================================================================================
&#9;foo

--------------------------------------------------------------------------------

(document
  (paragraph
    (character_reference)
    (text)))

================================================================================
Example 337 - https://github.github.com/gfm/#example-337
================================================================================
[a](url &quot;tit&quot;)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text)
    (character_reference)
    (text)
    (character_reference)
    (text)))

================================================================================
Example 338 - https://github.github.com/gfm/#example-338
================================================================================
`foo`

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 339 - https://github.github.com/gfm/#example-339
================================================================================
`` foo ` bar ``

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 340 - https://github.github.com/gfm/#example-340
================================================================================
` `` `

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 341 - https://github.github.com/gfm/#example-341
================================================================================
`  ``  `

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 342 - https://github.github.com/gfm/#example-342
================================================================================
` a`

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 343 - https://github.github.com/gfm/#example-343
================================================================================
` b `

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 344 - https://github.github.com/gfm/#example-344
================================================================================
` `
`  `

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))
    (soft_line_break)
    (code_span
      (text))))

================================================================================
Example 345 - https://github.github.com/gfm/#example-345
================================================================================
``
foo
bar  
baz
``

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 346 - https://github.github.com/gfm/#example-346
================================================================================
``
foo 
``

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 347 - https://github.github.com/gfm/#example-347
================================================================================
`foo   bar 
baz`

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 348 - https://github.github.com/gfm/#example-348
================================================================================
`foo\`bar`

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))
    (text)))

================================================================================
Example 349 - https://github.github.com/gfm/#example-349
================================================================================
``foo`bar``

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 350 - https://github.github.com/gfm/#example-350
================================================================================
` foo `` bar `

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 351 - https://github.github.com/gfm/#example-351
================================================================================
*foo`*`

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (code_span
      (text))))

================================================================================
Example 352 - https://github.github.com/gfm/#example-352
================================================================================
[not a `link](/foo`)

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (code_span
      (text))
    (text)))

================================================================================
Example 353 - https://github.github.com/gfm/#example-353
================================================================================
`<a href="`">`

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))
    (text)))

================================================================================
Example 354 - https://github.github.com/gfm/#example-354
================================================================================
<a href="`">`

--------------------------------------------------------------------------------

(document
  (paragraph
    (html_open_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text))))
    (text)))

================================================================================
Example 355 - https://github.github.com/gfm/#example-355
================================================================================
`<http://foo.bar.`baz>`

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))
    (text)))

================================================================================
Example 356 - https://github.github.com/gfm/#example-356
================================================================================
<http://foo.bar.`baz>`

--------------------------------------------------------------------------------

(document
  (paragraph
    (uri_autolink
      (text))
    (text)))

================================================================================
Example 357 - https://github.github.com/gfm/#example-357
================================================================================
```foo``

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 358 - https://github.github.com/gfm/#example-358
================================================================================
`foo

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 359 - https://github.github.com/gfm/#example-359
================================================================================
`foo``bar``

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (code_span
      (text))))

================================================================================
Example 360 - https://github.github.com/gfm/#example-360
================================================================================
*foo bar*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text))))

================================================================================
Example 361 - https://github.github.com/gfm/#example-361
================================================================================
a * foo bar*

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 362 - https://github.github.com/gfm/#example-362
================================================================================
a*"foo"*

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 363 - https://github.github.com/gfm/#example-363
================================================================================
* a *

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 364 - https://github.github.com/gfm/#example-364
================================================================================
foo*bar*

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (text))))

================================================================================
Example 365 - https://github.github.com/gfm/#example-365
================================================================================
5*6*78

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (text))
    (text)))

================================================================================
Example 366 - https://github.github.com/gfm/#example-366
================================================================================
_foo bar_

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text))))

================================================================================
Example 367 - https://github.github.com/gfm/#example-367
================================================================================
_ foo bar_

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 368 - https://github.github.com/gfm/#example-368
================================================================================
a_"foo"_

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 369 - https://github.github.com/gfm/#example-369
================================================================================
foo_bar_

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 370 - https://github.github.com/gfm/#example-370
================================================================================
5_6_78

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 371 - https://github.github.com/gfm/#example-371
================================================================================
пристаням_стремятся_

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 372 - https://github.github.com/gfm/#example-372
================================================================================
aa_"bb"_cc

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 373 - https://github.github.com/gfm/#example-373
================================================================================
foo-_(bar)_

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (text))))

================================================================================
Example 374 - https://github.github.com/gfm/#example-374
================================================================================
_foo*

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 375 - https://github.github.com/gfm/#example-375
================================================================================
*foo bar *

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 376 - https://github.github.com/gfm/#example-376
================================================================================
*foo bar
*

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 377 - https://github.github.com/gfm/#example-377
================================================================================
*(*foo)

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 378 - https://github.github.com/gfm/#example-378
================================================================================
*(*foo*)*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (emphasis
        (text))
      (text))))

================================================================================
Example 379 - https://github.github.com/gfm/#example-379
================================================================================
*foo*bar

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text))
    (text)))

================================================================================
Example 380 - https://github.github.com/gfm/#example-380
================================================================================
_foo bar _

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 381 - https://github.github.com/gfm/#example-381
================================================================================
_(_foo)

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 382 - https://github.github.com/gfm/#example-382
================================================================================
_(_foo_)_

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (emphasis
        (text))
      (text))))

================================================================================
Example 383 - https://github.github.com/gfm/#example-383
================================================================================
_foo_bar

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 384 - https://github.github.com/gfm/#example-384
================================================================================
_пристаням_стремятся

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 385 - https://github.github.com/gfm/#example-385
================================================================================
_foo_bar_baz_

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text))))

================================================================================
Example 386 - https://github.github.com/gfm/#example-386
================================================================================
_(bar)_.

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text))
    (text)))

================================================================================
Example 387 - https://github.github.com/gfm/#example-387
================================================================================
**foo bar**

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text))))

================================================================================
Example 388 - https://github.github.com/gfm/#example-388
================================================================================
** foo bar**

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 389 - https://github.github.com/gfm/#example-389
================================================================================
a**"foo"**

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 390 - https://github.github.com/gfm/#example-390
================================================================================
foo**bar**

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (strong_emphasis
      (text))))

================================================================================
Example 391 - https://github.github.com/gfm/#example-391
================================================================================
__foo bar__

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text))))

================================================================================
Example 392 - https://github.github.com/gfm/#example-392
================================================================================
__ foo bar__

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 393 - https://github.github.com/gfm/#example-393
================================================================================
__
foo bar__

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 394 - https://github.github.com/gfm/#example-394
================================================================================
a__"foo"__

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 395 - https://github.github.com/gfm/#example-395
================================================================================
foo__bar__

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 396 - https://github.github.com/gfm/#example-396
================================================================================
5__6__78

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 397 - https://github.github.com/gfm/#example-397
================================================================================
пристаням__стремятся__

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 398 - https://github.github.com/gfm/#example-398
================================================================================
__foo, __bar__, baz__

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text)
      (strong_emphasis
        (text))
      (text))))

================================================================================
Example 399 - https://github.github.com/gfm/#example-399
================================================================================
foo-__(bar)__

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (strong_emphasis
      (text))))

================================================================================
Example 400 - https://github.github.com/gfm/#example-400
================================================================================
**foo bar **

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 401 - https://github.github.com/gfm/#example-401
================================================================================
**(**foo)

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 402 - https://github.github.com/gfm/#example-402
================================================================================
*(**foo**)*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (strong_emphasis
        (text))
      (text))))

================================================================================
Example 403 - https://github.github.com/gfm/#example-403
================================================================================
**Gomphocarpus (*Gomphocarpus physocarpus*, syn.
*Asclepias physocarpa*)**

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text)
      (emphasis
        (text))
      (text)
      (soft_line_break)
      (emphasis
        (text))
      (text))))

================================================================================
Example 404 - https://github.github.com/gfm/#example-404
================================================================================
**foo "*bar*" foo**

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text)
      (emphasis
        (text))
      (text))))

================================================================================
Example 405 - https://github.github.com/gfm/#example-405
================================================================================
**foo**bar

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text))
    (text)))

================================================================================
Example 406 - https://github.github.com/gfm/#example-406
================================================================================
__foo bar __

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 407 - https://github.github.com/gfm/#example-407
================================================================================
__(__foo)

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 408 - https://github.github.com/gfm/#example-408
================================================================================
_(__foo__)_

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (strong_emphasis
        (text))
      (text))))

================================================================================
Example 409 - https://github.github.com/gfm/#example-409
================================================================================
__foo__bar

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 410 - https://github.github.com/gfm/#example-410
================================================================================
__пристаням__стремятся

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 411 - https://github.github.com/gfm/#example-411
================================================================================
__foo__bar__baz__

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text))))

================================================================================
Example 412 - https://github.github.com/gfm/#example-412
================================================================================
__(bar)__.

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text))
    (text)))

================================================================================
Example 413 - https://github.github.com/gfm/#example-413
================================================================================
*foo [bar](/url)*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (link
        (link_text
          (text))
        (link_destination
          (text))))))

================================================================================
Example 414 - https://github.github.com/gfm/#example-414
================================================================================
*foo
bar*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (soft_line_break)
      (text))))

================================================================================
Example 415 - https://github.github.com/gfm/#example-415
================================================================================
_foo __bar__ baz_

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (strong_emphasis
        (text))
      (text))))

================================================================================
Example 416 - https://github.github.com/gfm/#example-416
================================================================================
_foo _bar_ baz_

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (emphasis
        (text))
      (text))))

================================================================================
Example 417 - https://github.github.com/gfm/#example-417
================================================================================
__foo_ bar_

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (emphasis
        (text))
      (text))))

================================================================================
Example 418 - https://github.github.com/gfm/#example-418
================================================================================
*foo *bar**

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (emphasis
        (text)))))

================================================================================
Example 419 - https://github.github.com/gfm/#example-419
================================================================================
*foo **bar** baz*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (strong_emphasis
        (text))
      (text))))

================================================================================
Example 420 - https://github.github.com/gfm/#example-420
================================================================================
*foo**bar**baz*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (strong_emphasis
        (text))
      (text))))

================================================================================
Example 421 - https://github.github.com/gfm/#example-421
================================================================================
*foo**bar*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text))))

================================================================================
Example 422 - https://github.github.com/gfm/#example-422
================================================================================
***foo** bar*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (strong_emphasis
        (text))
      (text))))

================================================================================
Example 423 - https://github.github.com/gfm/#example-423
================================================================================
*foo **bar***

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (strong_emphasis
        (text)))))

================================================================================
Example 424 - https://github.github.com/gfm/#example-424
================================================================================
*foo**bar***

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (strong_emphasis
        (text)))))

================================================================================
Example 425 - https://github.github.com/gfm/#example-425
================================================================================
foo***bar***baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (strong_emphasis
        (text)))
    (text)))

================================================================================
Example 426 - https://github.github.com/gfm/#example-426
================================================================================
foo******bar*********baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (strong_emphasis
      (strong_emphasis
        (strong_emphasis
          (text))))
    (text)))

================================================================================
Example 427 - https://github.github.com/gfm/#example-427
================================================================================
*foo **bar *baz* bim** bop*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (strong_emphasis
        (text)
        (emphasis
          (text))
        (text))
      (text))))

================================================================================
Example 428 - https://github.github.com/gfm/#example-428
================================================================================
*foo [*bar*](/url)*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (link
        (link_text
          (emphasis
            (text)))
        (link_destination
          (text))))))

================================================================================
Example 429 - https://github.github.com/gfm/#example-429
================================================================================
** is not an empty emphasis

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 430 - https://github.github.com/gfm/#example-430
================================================================================
**** is not an empty strong emphasis

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 431 - https://github.github.com/gfm/#example-431
================================================================================
**foo [bar](/url)**

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text)
      (link
        (link_text
          (text))
        (link_destination
          (text))))))

================================================================================
Example 432 - https://github.github.com/gfm/#example-432
================================================================================
**foo
bar**

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text)
      (soft_line_break)
      (text))))

================================================================================
Example 433 - https://github.github.com/gfm/#example-433
================================================================================
__foo _bar_ baz__

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text)
      (emphasis
        (text))
      (text))))

================================================================================
Example 434 - https://github.github.com/gfm/#example-434
================================================================================
__foo __bar__ baz__

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text)
      (strong_emphasis
        (text))
      (text))))

================================================================================
Example 435 - https://github.github.com/gfm/#example-435
================================================================================
____foo__ bar__

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (strong_emphasis
        (text))
      (text))))

================================================================================
Example 436 - https://github.github.com/gfm/#example-436
================================================================================
**foo **bar****

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text)
      (strong_emphasis
        (text)))))

================================================================================
Example 437 - https://github.github.com/gfm/#example-437
================================================================================
**foo *bar* baz**

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text)
      (emphasis
        (text))
      (text))))

================================================================================
Example 438 - https://github.github.com/gfm/#example-438
================================================================================
**foo*bar*baz**

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text)
      (emphasis
        (text))
      (text))))

================================================================================
Example 439 - https://github.github.com/gfm/#example-439
================================================================================
***foo* bar**

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (emphasis
        (text))
      (text))))

================================================================================
Example 440 - https://github.github.com/gfm/#example-440
================================================================================
**foo *bar***

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text)
      (emphasis
        (text)))))

================================================================================
Example 441 - https://github.github.com/gfm/#example-441
================================================================================
**foo *bar **baz**
bim* bop**

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text)
      (emphasis
        (text)
        (strong_emphasis
          (text))
        (soft_line_break)
        (text))
      (text))))

================================================================================
Example 442 - https://github.github.com/gfm/#example-442
================================================================================
**foo [*bar*](/url)**

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text)
      (link
        (link_text
          (emphasis
            (text)))
        (link_destination
          (text))))))

================================================================================
Example 443 - https://github.github.com/gfm/#example-443
================================================================================
__ is not an empty emphasis

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 444 - https://github.github.com/gfm/#example-444
================================================================================
____ is not an empty strong emphasis

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 445 - https://github.github.com/gfm/#example-445
================================================================================
foo ***

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 446 - https://github.github.com/gfm/#example-446
================================================================================
foo *\**

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (backslash_escape))))

================================================================================
Example 447 - https://github.github.com/gfm/#example-447
================================================================================
foo *_*

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (text))))

================================================================================
Example 448 - https://github.github.com/gfm/#example-448
================================================================================
foo *****

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 449 - https://github.github.com/gfm/#example-449
================================================================================
foo **\***

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (strong_emphasis
      (backslash_escape))))

================================================================================
Example 450 - https://github.github.com/gfm/#example-450
================================================================================
foo **_**

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (strong_emphasis
      (text))))

================================================================================
Example 451 - https://github.github.com/gfm/#example-451
================================================================================
**foo*

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (text))))

================================================================================
Example 452 - https://github.github.com/gfm/#example-452
================================================================================
*foo**

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text))
    (text)))

================================================================================
Example 453 - https://github.github.com/gfm/#example-453
================================================================================
***foo**

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (strong_emphasis
      (text))))

================================================================================
Example 454 - https://github.github.com/gfm/#example-454
================================================================================
****foo*

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (text))))

================================================================================
Example 455 - https://github.github.com/gfm/#example-455
================================================================================
**foo***

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text))
    (text)))

================================================================================
Example 456 - https://github.github.com/gfm/#example-456
================================================================================
*foo****

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text))
    (text)))

================================================================================
Example 457 - https://github.github.com/gfm/#example-457
================================================================================
foo ___

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 458 - https://github.github.com/gfm/#example-458
================================================================================
foo _\__

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (backslash_escape))))

================================================================================
Example 459 - https://github.github.com/gfm/#example-459
================================================================================
foo _*_

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (text))))

================================================================================
Example 460 - https://github.github.com/gfm/#example-460
================================================================================
foo _____

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 461 - https://github.github.com/gfm/#example-461
================================================================================
foo __\___

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (strong_emphasis
      (backslash_escape))))

================================================================================
Example 462 - https://github.github.com/gfm/#example-462
================================================================================
foo __*__

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (strong_emphasis
      (text))))

================================================================================
Example 463 - https://github.github.com/gfm/#example-463
================================================================================
__foo_

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (text))))

================================================================================
Example 464 - https://github.github.com/gfm/#example-464
================================================================================
_foo__

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text))
    (text)))

================================================================================
Example 465 - https://github.github.com/gfm/#example-465
================================================================================
___foo__

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (strong_emphasis
      (text))))

================================================================================
Example 466 - https://github.github.com/gfm/#example-466
================================================================================
____foo_

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (text))))

================================================================================
Example 467 - https://github.github.com/gfm/#example-467
================================================================================
__foo___

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text))
    (text)))

================================================================================
Example 468 - https://github.github.com/gfm/#example-468
================================================================================
_foo____

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text))
    (text)))

================================================================================
Example 469 - https://github.github.com/gfm/#example-469
================================================================================
**foo**

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text))))

================================================================================
Example 470 - https://github.github.com/gfm/#example-470
================================================================================
*_foo_*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (emphasis
        (text)))))

================================================================================
Example 471 - https://github.github.com/gfm/#example-471
================================================================================
__foo__

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (text))))

================================================================================
Example 472 - https://github.github.com/gfm/#example-472
================================================================================
_*foo*_

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (emphasis
        (text)))))

================================================================================
Example 473 - https://github.github.com/gfm/#example-473
================================================================================
****foo****

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (strong_emphasis
        (text)))))

================================================================================
Example 474 - https://github.github.com/gfm/#example-474
================================================================================
____foo____

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (strong_emphasis
        (text)))))

================================================================================
Example 475 - https://github.github.com/gfm/#example-475
================================================================================
******foo******

--------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (strong_emphasis
        (strong_emphasis
          (text))))))

================================================================================
Example 476 - https://github.github.com/gfm/#example-476
================================================================================
***foo***

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (strong_emphasis
        (text)))))

================================================================================
Example 477 - https://github.github.com/gfm/#example-477
================================================================================
_____foo_____

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (strong_emphasis
        (strong_emphasis
          (text))))))

================================================================================
Example 478 - https://github.github.com/gfm/#example-478
================================================================================
*foo _bar* baz_

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text))
    (text)))

================================================================================
Example 479 - https://github.github.com/gfm/#example-479
================================================================================
*foo __bar *baz bim__ bam*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (strong_emphasis
        (text))
      (text))))

================================================================================
Example 480 - https://github.github.com/gfm/#example-480
================================================================================
**foo **bar baz**

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (strong_emphasis
      (text))))

================================================================================
Example 481 - https://github.github.com/gfm/#example-481
================================================================================
*foo *bar baz*

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (text))))

================================================================================
Example 482 - https://github.github.com/gfm/#example-482
================================================================================
*[bar*](/url)

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (link
      (link_text
        (text))
      (link_destination
        (text)))))

================================================================================
Example 483 - https://github.github.com/gfm/#example-483
================================================================================
_foo [bar_](/url)

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (link
      (link_text
        (text))
      (link_destination
        (text)))))

================================================================================
Example 484 - https://github.github.com/gfm/#example-484
================================================================================
*<img src="foo" title="*"/>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (html_self_closing_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text)))
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text))))))

================================================================================
Example 485 - https://github.github.com/gfm/#example-485
================================================================================
**<a href="**">

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (html_open_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text))))))

================================================================================
Example 486 - https://github.github.com/gfm/#example-486
================================================================================
__<a href="__">

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (html_open_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text))))))

================================================================================
Example 487 - https://github.github.com/gfm/#example-487
================================================================================
*a `*`*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (code_span
        (text)))))

================================================================================
Example 488 - https://github.github.com/gfm/#example-488
================================================================================
_a `_`_

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (code_span
        (text)))))

================================================================================
Example 489 - https://github.github.com/gfm/#example-489
================================================================================
**a<http://foo.bar/?q=**>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (uri_autolink
      (text))))

================================================================================
Example 490 - https://github.github.com/gfm/#example-490
================================================================================
__a<http://foo.bar/?q=__>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (uri_autolink
      (text))))

================================================================================
Example 491 - https://github.github.com/gfm/#example-491
================================================================================
~~Hi~~ Hello, world!

--------------------------------------------------------------------------------

(document
  (paragraph
    (strikethrough
      (text))
    (text)))

================================================================================
Example 492 - https://github.github.com/gfm/#example-492
================================================================================
This ~~has a

new paragraph~~.

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (paragraph
    (text)))

================================================================================
Example 493 - https://github.github.com/gfm/#example-493
================================================================================
[link](/uri "title")

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text))
      (link_title
        (text)))))

================================================================================
Example 494 - https://github.github.com/gfm/#example-494
================================================================================
[link](/uri)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)))))

================================================================================
Example 495 - https://github.github.com/gfm/#example-495
================================================================================
[link]()

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text)))

================================================================================
Example 496 - https://github.github.com/gfm/#example-496
================================================================================
[link](<>)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination))))

================================================================================
Example 497 - https://github.github.com/gfm/#example-497
================================================================================
[link](/my uri)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text)))

================================================================================
Example 498 - https://github.github.com/gfm/#example-498
================================================================================
[link](</my uri>)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)))))

================================================================================
Example 499 - https://github.github.com/gfm/#example-499
================================================================================
[link](foo
bar)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 500 - https://github.github.com/gfm/#example-500
================================================================================
[link](<foo
bar>)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text)
    (html_open_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)))
    (text)))

================================================================================
Example 501 - https://github.github.com/gfm/#example-501
================================================================================
[a](<b)c>)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)))))

================================================================================
Example 502 - https://github.github.com/gfm/#example-502
================================================================================
[link](<foo\>)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text)
    (backslash_escape)
    (text)))

================================================================================
Example 503 - https://github.github.com/gfm/#example-503
================================================================================
[a](<b)c
[a](<b)c>
[a](<b>c)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text)
    (soft_line_break)
    (link
      (link_text
        (text)))
    (text)
    (soft_line_break)
    (link
      (link_text
        (text)))
    (text)
    (html_open_tag
      (html_tag_name))
    (text)))

================================================================================
Example 504 - https://github.github.com/gfm/#example-504
================================================================================
[link](\(foo\))

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (backslash_escape)
        (text)
        (backslash_escape)))))

================================================================================
Example 505 - https://github.github.com/gfm/#example-505
================================================================================
[link](foo(and(bar)))

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)))))

================================================================================
Example 506 - https://github.github.com/gfm/#example-506
================================================================================
[link](foo\(and\(bar\))

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)
        (backslash_escape)
        (text)
        (backslash_escape)
        (text)
        (backslash_escape)))))

================================================================================
Example 507 - https://github.github.com/gfm/#example-507
================================================================================
[link](<foo(and(bar)>)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)))))

================================================================================
Example 508 - https://github.github.com/gfm/#example-508
================================================================================
[link](foo\)\:)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)
        (backslash_escape)
        (backslash_escape)))))

================================================================================
Example 509 - https://github.github.com/gfm/#example-509
================================================================================
[link](#fragment)

[link](http://example.com#fragment)

[link](http://example.com?foo=3#frag)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text))))
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text))))
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)))))

================================================================================
Example 510 - https://github.github.com/gfm/#example-510
================================================================================
[link](foo\bar)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)))))

================================================================================
Example 511 - https://github.github.com/gfm/#example-511
================================================================================
[link](foo%20b&auml;)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)
        (character_reference)))))

================================================================================
Example 512 - https://github.github.com/gfm/#example-512
================================================================================
[link]("title")

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)))))

================================================================================
Example 513 - https://github.github.com/gfm/#example-513
================================================================================
[link](/url "title")
[link](/url 'title')
[link](/url (title))

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text))
      (link_title
        (text)))
    (soft_line_break)
    (link
      (link_text
        (text))
      (link_destination
        (text))
      (link_title
        (text)))
    (soft_line_break)
    (link
      (link_text
        (text))
      (link_destination
        (text))
      (link_title
        (text)))))

================================================================================
Example 514 - https://github.github.com/gfm/#example-514
================================================================================
[link](/url "title \"&quot;")

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text))
      (link_title
        (text)
        (backslash_escape)
        (character_reference)))))

================================================================================
Example 515 - https://github.github.com/gfm/#example-515
================================================================================
[link](/url "title")

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)))))

================================================================================
Example 516 - https://github.github.com/gfm/#example-516
================================================================================
[link](/url "title "and" title")

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text)))

================================================================================
Example 517 - https://github.github.com/gfm/#example-517
================================================================================
[link](/url 'title "and" title')

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text))
      (link_title
        (text)))))

================================================================================
Example 518 - https://github.github.com/gfm/#example-518
================================================================================
[link](   /uri
  "title"  )

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text))
      (link_title
        (text)))))

================================================================================
Example 519 - https://github.github.com/gfm/#example-519
================================================================================
[link] (/uri)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text)))

================================================================================
Example 520 - https://github.github.com/gfm/#example-520
================================================================================
[link [foo [bar]]](/uri)

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (link
      (link_text
        (text)))
    (text)))

================================================================================
Example 521 - https://github.github.com/gfm/#example-521
================================================================================
[link] bar](/uri)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text)))

================================================================================
Example 522 - https://github.github.com/gfm/#example-522
================================================================================
[link [bar](/uri)

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (link
      (link_text
        (text))
      (link_destination
        (text)))))

================================================================================
Example 523 - https://github.github.com/gfm/#example-523
================================================================================
[link \[bar](/uri)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)
        (backslash_escape)
        (text))
      (link_destination
        (text)))))

================================================================================
Example 524 - https://github.github.com/gfm/#example-524
================================================================================
[link *foo **bar** `#`*](/uri)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)
        (emphasis
          (text)
          (strong_emphasis
            (text))
          (text)
          (code_span
            (text))))
      (link_destination
        (text)))))

================================================================================
Example 525 - https://github.github.com/gfm/#example-525
================================================================================
[![moon](moon.jpg)](/uri)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (image
          (image_description
            (text))
          (link_destination
            (text))))
      (link_destination
        (text)))))

================================================================================
Example 526 - https://github.github.com/gfm/#example-526
================================================================================
[foo [bar](/uri)](/uri)

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (link
      (link_text
        (text))
      (link_destination
        (text)))
    (text)))

================================================================================
Example 527 - https://github.github.com/gfm/#example-527
================================================================================
[foo *[bar [baz](/uri)](/uri)*](/uri)

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (text)
      (link
        (link_text
          (text))
        (link_destination
          (text)))
      (text))
    (text)))

================================================================================
Example 528 - https://github.github.com/gfm/#example-528
================================================================================
![[[foo](uri1)](uri2)](uri3)

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text)
        (link
          (link_text
            (text))
          (link_destination
            (text)))
        (text))
      (link_destination
        (text)))))

================================================================================
Example 529 - https://github.github.com/gfm/#example-529
================================================================================
*[foo*](/uri)

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (link
      (link_text
        (text))
      (link_destination
        (text)))))

================================================================================
Example 530 - https://github.github.com/gfm/#example-530
================================================================================
[foo *bar](baz*)

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_destination
        (text)))))

================================================================================
Example 531 - https://github.github.com/gfm/#example-531
================================================================================
*foo [bar* baz]

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (link
      (link_text
        (text)))))

================================================================================
Example 532 - https://github.github.com/gfm/#example-532
================================================================================
[foo <bar attr="](baz)">

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (html_open_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text))))))

================================================================================
Example 533 - https://github.github.com/gfm/#example-533
================================================================================
[foo`](/uri)`

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (code_span
      (text))))

================================================================================
Example 534 - https://github.github.com/gfm/#example-534
================================================================================
[foo<http://example.com/?search=](uri)>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (uri_autolink
      (text))))

================================================================================
Example 535 - https://github.github.com/gfm/#example-535
================================================================================
[foo][bar]

[bar]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_label
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 536 - https://github.github.com/gfm/#example-536
================================================================================
[link [foo [bar]]][ref]

[ref]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (link
      (link_text
        (text)))
    (text)
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 537 - https://github.github.com/gfm/#example-537
================================================================================
[link \[bar][ref]

[ref]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)
        (backslash_escape)
        (text))
      (link_label
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 538 - https://github.github.com/gfm/#example-538
================================================================================
[link *foo **bar** `#`*][ref]

[ref]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)
        (emphasis
          (text)
          (strong_emphasis
            (text))
          (text)
          (code_span
            (text))))
      (link_label
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 539 - https://github.github.com/gfm/#example-539
================================================================================
[![moon](moon.jpg)][ref]

[ref]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (image
          (image_description
            (text))
          (link_destination
            (text))))
      (link_label
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 540 - https://github.github.com/gfm/#example-540
================================================================================
[foo [bar](/uri)][ref]

[ref]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (link
      (link_text
        (text))
      (link_destination
        (text)))
    (text)
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 541 - https://github.github.com/gfm/#example-541
================================================================================
[foo *bar [baz][ref]*][ref]

[ref]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (emphasis
      (text)
      (link
        (link_text
          (text))
        (link_label
          (text))))
    (text)
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 542 - https://github.github.com/gfm/#example-542
================================================================================
*[foo*][ref]

[ref]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (link
      (link_text
        (text))
      (link_label
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 543 - https://github.github.com/gfm/#example-543
================================================================================
[foo *bar][ref]*

[ref]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_label
        (text)))
    (text))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 544 - https://github.github.com/gfm/#example-544
================================================================================
[foo <bar attr="][ref]">

[ref]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (html_open_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text)))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 545 - https://github.github.com/gfm/#example-545
================================================================================
[foo`][ref]`

[ref]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (code_span
      (text)))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 546 - https://github.github.com/gfm/#example-546
================================================================================
[foo<http://example.com/?search=][ref]>

[ref]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (uri_autolink
      (text)))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 547 - https://github.github.com/gfm/#example-547
================================================================================
[foo][BaR]

[bar]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_label
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 548 - https://github.github.com/gfm/#example-548
================================================================================
[ẞ]

[SS]: /url

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 549 - https://github.github.com/gfm/#example-549
================================================================================
[Foo
  bar]: /url

[Baz][Foo bar]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (paragraph
    (link
      (link_text
        (text))
      (link_label
        (text)))))

================================================================================
Example 550 - https://github.github.com/gfm/#example-550
================================================================================
[foo] [bar]

[bar]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text)
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 551 - https://github.github.com/gfm/#example-551
================================================================================
[foo]
[bar]

[bar]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (soft_line_break)
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 552 - https://github.github.com/gfm/#example-552
================================================================================
[foo]: /url1

[foo]: /url2

[bar][foo]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (paragraph
    (link
      (link_text
        (text))
      (link_label
        (text)))))

================================================================================
Example 553 - https://github.github.com/gfm/#example-553
================================================================================
[bar][foo\!]

[foo!]: /url

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_label
        (text)
        (backslash_escape))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 554 - https://github.github.com/gfm/#example-554
================================================================================
[foo][ref[]

[ref[]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text))
  (paragraph
    (text)))

================================================================================
Example 555 - https://github.github.com/gfm/#example-555
================================================================================
[foo][ref[bar]]

[ref[bar]]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text)
    (link
      (link_text
        (text)))
    (text))
  (paragraph
    (text)
    (link
      (link_text
        (text)))
    (text)))

================================================================================
Example 556 - https://github.github.com/gfm/#example-556
================================================================================
[[[foo]]]

[[[foo]]]: /url

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (link
      (link_text
        (text)))
    (text))
  (paragraph
    (text)
    (link
      (link_text
        (text)))
    (text)))

================================================================================
Example 557 - https://github.github.com/gfm/#example-557
================================================================================
[foo][ref\[]

[ref\[]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_label
        (text)
        (backslash_escape))))
  (link_reference_definition
    (link_label
      (text)
      (backslash_escape))
    (link_destination
      (text))))

================================================================================
Example 558 - https://github.github.com/gfm/#example-558
================================================================================
[bar\\]: /uri

[bar\\]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text)
      (backslash_escape))
    (link_destination
      (text)))
  (paragraph
    (link
      (link_text
        (text)
        (backslash_escape)))))

================================================================================
Example 559 - https://github.github.com/gfm/#example-559
================================================================================
[]

[]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (paragraph
    (text)))

================================================================================
Example 560 - https://github.github.com/gfm/#example-560
================================================================================
[
 ]

[
 ]: /uri

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text))
  (paragraph
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 561 - https://github.github.com/gfm/#example-561
================================================================================
[foo][]

[foo]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 562 - https://github.github.com/gfm/#example-562
================================================================================
[*foo* bar][]

[*foo* bar]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (emphasis
          (text))
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 563 - https://github.github.com/gfm/#example-563
================================================================================
[Foo][]

[foo]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 564 - https://github.github.com/gfm/#example-564
================================================================================
[foo] 
[]

[foo]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (soft_line_break)
    (text))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 565 - https://github.github.com/gfm/#example-565
================================================================================
[foo]

[foo]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 566 - https://github.github.com/gfm/#example-566
================================================================================
[*foo* bar]

[*foo* bar]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (emphasis
          (text))
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 567 - https://github.github.com/gfm/#example-567
================================================================================
[[*foo* bar]]

[*foo* bar]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (link
      (link_text
        (emphasis
          (text))
        (text)))
    (text))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 568 - https://github.github.com/gfm/#example-568
================================================================================
[[bar [foo]

[foo]: /url

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 569 - https://github.github.com/gfm/#example-569
================================================================================
[Foo]

[foo]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 570 - https://github.github.com/gfm/#example-570
================================================================================
[foo] bar

[foo]: /url

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 571 - https://github.github.com/gfm/#example-571
================================================================================
\[foo]

[foo]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (backslash_escape)
    (text))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 572 - https://github.github.com/gfm/#example-572
================================================================================
[foo*]: /url

*[foo*]

--------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (paragraph
    (text)
    (link
      (link_text
        (text)))))

================================================================================
Example 573 - https://github.github.com/gfm/#example-573
================================================================================
[foo][bar]

[foo]: /url1
[bar]: /url2

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_label
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 574 - https://github.github.com/gfm/#example-574
================================================================================
[foo][]

[foo]: /url1

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 575 - https://github.github.com/gfm/#example-575
================================================================================
[foo]()

[foo]: /url1

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 576 - https://github.github.com/gfm/#example-576
================================================================================
[foo](not a link)

[foo]: /url1

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text)))
    (text))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 577 - https://github.github.com/gfm/#example-577
================================================================================
[foo][bar][baz]

[baz]: /url

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_label
        (text)))
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 578 - https://github.github.com/gfm/#example-578
================================================================================
[foo][bar][baz]

[baz]: /url1
[bar]: /url2

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_label
        (text)))
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 579 - https://github.github.com/gfm/#example-579
================================================================================
[foo][bar][baz]

[baz]: /url1
[foo]: /url2

--------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (text))
      (link_label
        (text)))
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text)))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 580 - https://github.github.com/gfm/#example-580
================================================================================
![foo](/url "title")

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text))
      (link_destination
        (text))
      (link_title
        (text)))))

================================================================================
Example 581 - https://github.github.com/gfm/#example-581
================================================================================
![foo *bar*]

[foo *bar*]: train.jpg "train & tracks"

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text)
        (emphasis
          (text)))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 582 - https://github.github.com/gfm/#example-582
================================================================================
![foo ![bar](/url)](/url2)

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text)
        (image
          (image_description
            (text))
          (link_destination
            (text))))
      (link_destination
        (text)))))

================================================================================
Example 583 - https://github.github.com/gfm/#example-583
================================================================================
![foo [bar](/url)](/url2)

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text)
        (link
          (link_text
            (text))
          (link_destination
            (text))))
      (link_destination
        (text)))))

================================================================================
Example 584 - https://github.github.com/gfm/#example-584
================================================================================
![foo *bar*][]

[foo *bar*]: train.jpg "train & tracks"

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text)
        (emphasis
          (text)))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 585 - https://github.github.com/gfm/#example-585
================================================================================
![foo *bar*][foobar]

[FOOBAR]: train.jpg "train & tracks"

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text)
        (emphasis
          (text)))
      (link_label
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 586 - https://github.github.com/gfm/#example-586
================================================================================
![foo](train.jpg)

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text))
      (link_destination
        (text)))))

================================================================================
Example 587 - https://github.github.com/gfm/#example-587
================================================================================
My ![foo bar](/path/to/train.jpg  "title"   )

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (image
      (image_description
        (text))
      (link_destination
        (text))
      (link_title
        (text)))))

================================================================================
Example 588 - https://github.github.com/gfm/#example-588
================================================================================
![foo](<url>)

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text))
      (link_destination
        (text)))))

================================================================================
Example 589 - https://github.github.com/gfm/#example-589
================================================================================
![](/url)

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (link_destination
        (text)))))

================================================================================
Example 590 - https://github.github.com/gfm/#example-590
================================================================================
![foo][bar]

[bar]: /url

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text))
      (link_label
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 591 - https://github.github.com/gfm/#example-591
================================================================================
![foo][bar]

[BAR]: /url

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text))
      (link_label
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))))

================================================================================
Example 592 - https://github.github.com/gfm/#example-592
================================================================================
![foo][]

[foo]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 593 - https://github.github.com/gfm/#example-593
================================================================================
![*foo* bar][]

[*foo* bar]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (emphasis
          (text))
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 594 - https://github.github.com/gfm/#example-594
================================================================================
![Foo][]

[foo]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 595 - https://github.github.com/gfm/#example-595
================================================================================
![foo] 
[]

[foo]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text)))
    (soft_line_break)
    (text))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 596 - https://github.github.com/gfm/#example-596
================================================================================
![foo]

[foo]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 597 - https://github.github.com/gfm/#example-597
================================================================================
![*foo* bar]

[*foo* bar]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (emphasis
          (text))
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 598 - https://github.github.com/gfm/#example-598
================================================================================
![[foo]]

[[foo]]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (link
          (link_text
            (text))))))
  (paragraph
    (text)
    (link
      (link_text
        (text)))
    (text)))

================================================================================
Example 599 - https://github.github.com/gfm/#example-599
================================================================================
![Foo]

[foo]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 600 - https://github.github.com/gfm/#example-600
================================================================================
!\[foo]

[foo]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (backslash_escape)
    (text))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 601 - https://github.github.com/gfm/#example-601
================================================================================
\![foo]

[foo]: /url "title"

--------------------------------------------------------------------------------

(document
  (paragraph
    (backslash_escape)
    (link
      (link_text
        (text))))
  (link_reference_definition
    (link_label
      (text))
    (link_destination
      (text))
    (link_title
      (text))))

================================================================================
Example 602 - https://github.github.com/gfm/#example-602
================================================================================
<http://foo.bar.baz>

--------------------------------------------------------------------------------

(document
  (paragraph
    (uri_autolink
      (text))))

================================================================================
Example 603 - https://github.github.com/gfm/#example-603
================================================================================
<http://foo.bar.baz/test?q=hello&id=22&boolean>

--------------------------------------------------------------------------------

(document
  (paragraph
    (uri_autolink
      (text))))

================================================================================
Example 604 - https://github.github.com/gfm/#example-604
================================================================================
<irc://foo.bar:2233/baz>

--------------------------------------------------------------------------------

(document
  (paragraph
    (uri_autolink
      (text))))

================================================================================
Example 605 - https://github.github.com/gfm/#example-605
================================================================================
<MAILTO:FOO@BAR.BAZ>

--------------------------------------------------------------------------------

(document
  (paragraph
    (uri_autolink
      (text))))

================================================================================
Example 606 - https://github.github.com/gfm/#example-606
================================================================================
<a+b+c:d>

--------------------------------------------------------------------------------

(document
  (paragraph
    (uri_autolink
      (text))))

================================================================================
Example 607 - https://github.github.com/gfm/#example-607
================================================================================
<made-up-scheme://foo,bar>

--------------------------------------------------------------------------------

(document
  (paragraph
    (uri_autolink
      (text))))

================================================================================
Example 608 - https://github.github.com/gfm/#example-608
================================================================================
<http://../>

--------------------------------------------------------------------------------

(document
  (paragraph
    (uri_autolink
      (text))))

================================================================================
Example 609 - https://github.github.com/gfm/#example-609
================================================================================
<localhost:5001/foo>

--------------------------------------------------------------------------------

(document
  (paragraph
    (uri_autolink
      (text))))

================================================================================
Example 610 - https://github.github.com/gfm/#example-610
================================================================================
<http://foo.bar/baz bim>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 611 - https://github.github.com/gfm/#example-611
================================================================================
<http://example.com/\[\>

--------------------------------------------------------------------------------

(document
  (paragraph
    (uri_autolink
      (text))))

================================================================================
Example 612 - https://github.github.com/gfm/#example-612
================================================================================
<foo@bar.example.com>

--------------------------------------------------------------------------------

(document
  (paragraph
    (email_autolink
      (text))))

================================================================================
Example 613 - https://github.github.com/gfm/#example-613
================================================================================
<foo+special@Bar.baz-bar0.com>

--------------------------------------------------------------------------------

(document
  (paragraph
    (email_autolink
      (text))))

================================================================================
Example 614 - https://github.github.com/gfm/#example-614
================================================================================
<foo\+@bar.example.com>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (backslash_escape)
    (text)))

================================================================================
Example 615 - https://github.github.com/gfm/#example-615
================================================================================
<>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 616 - https://github.github.com/gfm/#example-616
================================================================================
< http://foo.bar >

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (uri_autolink
      (text))
    (text)))

================================================================================
Example 617 - https://github.github.com/gfm/#example-617
================================================================================
<m:abc>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 618 - https://github.github.com/gfm/#example-618
================================================================================
<foo.bar.baz>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 619 - https://github.github.com/gfm/#example-619
================================================================================
http://example.com

--------------------------------------------------------------------------------

(document
  (paragraph
    (uri_autolink
      (text))))

================================================================================
Example 620 - https://github.github.com/gfm/#example-620
================================================================================
foo@bar.example.com

--------------------------------------------------------------------------------

(document
  (paragraph
    (email_autolink
      (text))))

================================================================================
Example 621 - https://github.github.com/gfm/#example-621
================================================================================
www.commonmark.org

--------------------------------------------------------------------------------

(document
  (paragraph
    (www_autolink
      (text))))

================================================================================
Example 622 - https://github.github.com/gfm/#example-622
================================================================================
Visit www.commonmark.org/help for more information.

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (www_autolink
      (text))
    (text)))

================================================================================
Example 623 - https://github.github.com/gfm/#example-623
================================================================================
Visit www.commonmark.org.

Visit www.commonmark.org/a.b.

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (www_autolink
      (text))
    (text))
  (paragraph
    (text)
    (www_autolink
      (text))
    (text)))

================================================================================
Example 624 - https://github.github.com/gfm/#example-624
================================================================================
www.google.com/search?q=Markup+(business)

www.google.com/search?q=Markup+(business)))

(www.google.com/search?q=Markup+(business))

(www.google.com/search?q=Markup+(business)

--------------------------------------------------------------------------------

(document
  (paragraph
    (www_autolink
      (text)))
  (paragraph
    (www_autolink
      (text))
    (text))
  (paragraph
    (text)
    (www_autolink
      (text))
    (text))
  (paragraph
    (text)
    (www_autolink
      (text))))

================================================================================
Example 625 - https://github.github.com/gfm/#example-625
================================================================================
www.google.com/search?q=(business))+ok

--------------------------------------------------------------------------------

(document
  (paragraph
    (www_autolink
      (text))))

================================================================================
Example 626 - https://github.github.com/gfm/#example-626
================================================================================
www.google.com/search?q=commonmark&hl=en

www.google.com/search?q=commonmark&hl;

--------------------------------------------------------------------------------

(document
  (paragraph
    (www_autolink
      (text)))
  (paragraph
    (www_autolink
      (text))
    (text)))

================================================================================
Example 627 - https://github.github.com/gfm/#example-627
================================================================================
www.commonmark.org/he<lp

--------------------------------------------------------------------------------

(document
  (paragraph
    (www_autolink
      (text))
    (text)))

================================================================================
Example 628 - https://github.github.com/gfm/#example-628
================================================================================
http://commonmark.org

(Visit https://encrypted.google.com/search?q=Markup+(business))

--------------------------------------------------------------------------------

(document
  (paragraph
    (uri_autolink
      (text)))
  (paragraph
    (text)
    (uri_autolink
      (text))
    (text)))

================================================================================
Example 629 - https://github.github.com/gfm/#example-629
================================================================================
foo@bar.baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (email_autolink
      (text))))

================================================================================
Example 630 - https://github.github.com/gfm/#example-630
================================================================================
hello@mail+xyz.example isn't valid, but hello+xyz@mail.example is.

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (email_autolink
      (text))
    (text)))

================================================================================
Example 631 - https://github.github.com/gfm/#example-631
================================================================================
a.b-c_d@a.b

a.b-c_d@a.b.

a.b-c_d@a.b-

a.b-c_d@a.b_

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (email_autolink
      (text)))
  (paragraph
    (text)
    (email_autolink
      (text))
    (text))
  (paragraph
    (text))
  (paragraph
    (text)))

================================================================================
Example 632 - https://github.github.com/gfm/#example-632
================================================================================
<a><bab><c2c>

--------------------------------------------------------------------------------

(document
  (paragraph
    (html_open_tag
      (html_tag_name))
    (html_open_tag
      (html_tag_name))
    (html_open_tag
      (html_tag_name))))

================================================================================
Example 633 - https://github.github.com/gfm/#example-633
================================================================================
<a/><b2/>

--------------------------------------------------------------------------------

(document
  (paragraph
    (html_self_closing_tag
      (html_tag_name))
    (html_self_closing_tag
      (html_tag_name))))

================================================================================
Example 634 - https://github.github.com/gfm/#example-634
================================================================================
<a  /><b2
data="foo" >

--------------------------------------------------------------------------------

(document
  (paragraph
    (html_self_closing_tag
      (html_tag_name))
    (html_open_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text))))))

================================================================================
Example 635 - https://github.github.com/gfm/#example-635
================================================================================
<a foo="bar" bam = 'baz <em>"</em>'
_boolean zoop:33=zoop:33 />

--------------------------------------------------------------------------------

(document
  (paragraph
    (html_self_closing_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text)))
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text)))
      (html_atrribute
        (html_attribute_key))
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text))))))

================================================================================
Example 636 - https://github.github.com/gfm/#example-636
================================================================================
Foo <responsive-image src="foo.jpg" />

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (html_self_closing_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text))))))

================================================================================
Example 637 - https://github.github.com/gfm/#example-637
================================================================================
<33> <__>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 638 - https://github.github.com/gfm/#example-638
================================================================================
<a h*#ref="hi">

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 639 - https://github.github.com/gfm/#example-639
================================================================================
<a href="hi'> <a href=hi'>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 640 - https://github.github.com/gfm/#example-640
================================================================================
< a><
foo><bar/ >
<foo bar=baz
bim!bop />

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)
    (soft_line_break)
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 641 - https://github.github.com/gfm/#example-641
================================================================================
<a href='bar'title=title>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 642 - https://github.github.com/gfm/#example-642
================================================================================
</a></foo >

--------------------------------------------------------------------------------

(document
  (paragraph
    (html_close_tag
      (html_tag_name))
    (html_close_tag
      (html_tag_name))))

================================================================================
Example 643 - https://github.github.com/gfm/#example-643
================================================================================
</a href="foo">

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 644 - https://github.github.com/gfm/#example-644
================================================================================
foo <!-- this is a
comment - with hyphen -->

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (html_comment
      (text))))

================================================================================
Example 645 - https://github.github.com/gfm/#example-645
================================================================================
foo <!-- not a comment -- two hyphens -->

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 646 - https://github.github.com/gfm/#example-646
================================================================================
foo <!--> foo -->

foo <!-- foo--->

--------------------------------------------------------------------------------

(document
  (paragraph
    (text))
  (paragraph
    (text)))

================================================================================
Example 647 - https://github.github.com/gfm/#example-647
================================================================================
foo <?php echo $a; ?>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (html_processing_instruction
      (text))))

================================================================================
Example 648 - https://github.github.com/gfm/#example-648
================================================================================
foo <!ELEMENT br EMPTY>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (html_declaration
      (html_declaration_name)
      (text))))

================================================================================
Example 649 - https://github.github.com/gfm/#example-649
================================================================================
foo <![CDATA[>&<]]>

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (html_cdata_section
      (text))))

================================================================================
Example 650 - https://github.github.com/gfm/#example-650
================================================================================
foo <a href="&ouml;">

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (html_open_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text))))))

================================================================================
Example 651 - https://github.github.com/gfm/#example-651
================================================================================
foo <a href="\*">

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (html_open_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text))))))

================================================================================
Example 652 - https://github.github.com/gfm/#example-652
================================================================================
<a href="\"">

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (backslash_escape)
    (text)))

================================================================================
Example 653 - https://github.github.com/gfm/#example-653
================================================================================
<strong> <title> <style> <em>

<blockquote>
  <xmp> is disallowed.  <XMP> is also disallowed.
</blockquote>

--------------------------------------------------------------------------------

(document
  (paragraph
    (html_open_tag
      (html_tag_name))
    (text)
    (html_open_tag
      (html_tag_name))
    (text)
    (html_open_tag
      (html_tag_name))
    (text)
    (html_open_tag
      (html_tag_name)))
  (html_block
    (text)
    (line_break)
    (text)
    (line_break)
    (text)))

================================================================================
Example 654 - https://github.github.com/gfm/#example-654
================================================================================
foo  
baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (hard_line_break)
    (text)))

================================================================================
Example 655 - https://github.github.com/gfm/#example-655
================================================================================
foo\
baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (hard_line_break)
    (text)))

================================================================================
Example 656 - https://github.github.com/gfm/#example-656
================================================================================
foo       
baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (hard_line_break)
    (text)))

================================================================================
Example 657 - https://github.github.com/gfm/#example-657
================================================================================
foo  
     bar

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (hard_line_break)
    (text)))

================================================================================
Example 658 - https://github.github.com/gfm/#example-658
================================================================================
foo\
     bar

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (hard_line_break)
    (text)))

================================================================================
Example 659 - https://github.github.com/gfm/#example-659
================================================================================
*foo  
bar*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (hard_line_break)
      (text))))

================================================================================
Example 660 - https://github.github.com/gfm/#example-660
================================================================================
*foo\
bar*

--------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (text)
      (hard_line_break)
      (text))))

================================================================================
Example 661 - https://github.github.com/gfm/#example-661
================================================================================
`code  
span`

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 662 - https://github.github.com/gfm/#example-662
================================================================================
`code\
span`

--------------------------------------------------------------------------------

(document
  (paragraph
    (code_span
      (text))))

================================================================================
Example 663 - https://github.github.com/gfm/#example-663
================================================================================
<a href="foo  
bar">

--------------------------------------------------------------------------------

(document
  (paragraph
    (html_open_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text))))))

================================================================================
Example 664 - https://github.github.com/gfm/#example-664
================================================================================
<a href="foo\
bar">

--------------------------------------------------------------------------------

(document
  (paragraph
    (html_open_tag
      (html_tag_name)
      (html_atrribute
        (html_attribute_key)
        (html_attribute_value
          (text))))))

================================================================================
Example 665 - https://github.github.com/gfm/#example-665
================================================================================
foo\

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 666 - https://github.github.com/gfm/#example-666
================================================================================
foo  

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 667 - https://github.github.com/gfm/#example-667
================================================================================
### foo\

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text))))

================================================================================
Example 668 - https://github.github.com/gfm/#example-668
================================================================================
### foo  

--------------------------------------------------------------------------------

(document
  (atx_heading
    (atx_heading_marker)
    (heading_content
      (text))))

================================================================================
Example 669 - https://github.github.com/gfm/#example-669
================================================================================
foo
baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 670 - https://github.github.com/gfm/#example-670
================================================================================
foo 
 baz

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)
    (soft_line_break)
    (text)))

================================================================================
Example 671 - https://github.github.com/gfm/#example-671
================================================================================
hello $.;'there

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 672 - https://github.github.com/gfm/#example-672
================================================================================
Foo χρῆν

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))

================================================================================
Example 673 - https://github.github.com/gfm/#example-673
================================================================================
Multiple     spaces

--------------------------------------------------------------------------------

(document
  (paragraph
    (text)))
